[
  {
    "file": "Advanced Blockchain-Enabled Electronic Document Management System with Integrated Verification Module- A Review.pdf",
    "title": "Date of publication xxxx 00, 0000, date of current version xxxx 00, 0000",
    "text": "International Journal of Environmental Sciences   \nISSN: 2229 -7359  \n Vol. 11 No. 2, 2025  \nhttps://www.theaspd.com/ijes.php   \n \n738 Advanced Blockchain -Enabled Electronic Document Management \nSystem with Integrated Verification Module: A Review  \n \nMr.P.  Thanigesan1, Dr.P. Vinothiyalakshmi2 \n1 Assistant Professor, Indira Institute of Engineering and Technology, Thiruvallur, Tamil Nadu  \n2 Professor. Sri Venkateswara College of Engineering, Sriperumbudur, Tamil Nadu.  \n*Corresponding Author : Thanigesan P  \n*(e-mail: thanigsn3@gmail.com ) \n \nAbstract  \nThe development in the use of digital technologies has greatly revolutionised the way in which the documents are handled in the \norganisations bringing the necessity of secure and effective electronic document management systems (EDMS). Analysing the tra ditional \napproach to EDMS we can state that it is effective but it commonly has a number of issues sta rting from document verification, data \nintegrity, and security. Its distributed, worldwide and immutable character of the blockchain technology can possibly help to  handle these \nchallenges. In this review, integration of the blockchain technology into the EDMS is presented with emphasis on systems with integrated \nverification modules. We start from explaining the key principles behind EDMS and the blockchain technology respectively noti ng their \nstrong and weak points. The benefits of blockchain -powered EDMS  are identified and discussed, pointing out such aspects of the \ndecentralised architecture as enhanced security, an impossibility to modify the data unlawfully, and the trustworthiness of t he data. Also, \nthe role taken by the modules of integrated verifica tion in authentication of documents is studied in detail and how they help maintain \ntrust and compliance within many industries. The review goes in deep into the technical architecture of blockchain -enabled EDMS i.e. how \nthe blockchain layers and verificat ion modules interplay to provide secure and robust document solution. We cover the huge benefits of the \nEnigma project in terms of security, privacy, and the issues related to scalability, compliance to regulations, and acceptanc e by users. Case \nstudies an d use cases are given to demonstrate the useful benefits and practical strategies on the use of blockchain -enabled EDMS in various \nsectors, i.e., healthcare, finance, legal services, etc. A comparative evaluation is made on blockchain -facilitated EDMS in c omparison with \nthe conventional systems and other advanced technologies such as AI and cloud computing among others. This analysis makes it possible \nto gain a complete picture of the specific opportunities and the possible setbacks of implementing the bloc kchain in the management of \ndocuments. Thirdly, we give the future direction and research that enables us to identify the need for further improvement in  blockchain -\nbased EDMS. Conclusively, the use of blockchain technology is an alternative to the tradit\nInternational Journal of Environmental Sciences   \nISSN: 2229 -7359  \n Vol. 11 No. 2, 2025  \nhttps://www.theaspd.com/ijes.php   \n \n739 requirements and where document authenticity is of the key importance. Consequently, blockchain -based EDMS is a \ntremendous improvement compared to the traditional EDMS in terms of security, dependability, and belief.  \n1.1 Importance of document verification  \nDocument verification is the vital part of any electronic document management system (EDMS) to achieve the authenticity \nof documents, integrity in digital documents, and reliability of digital documents. In an era of digital space where document s \nare const antly shared, edited, and accessed by a number of stake holders, establishing the validity of documents is a priority. \nThis authentication procedure ascertains that documents are valid and not fabricated or meddled with thus vital in ensuring \nbusiness proc esses and legal issues as well as compliance to regulations are trusted. Preservation of data integrity is one of \nthe major reasons as to why document verification is so important. Documents are usually used as an official registration in \nvarious industrie s, and any changeover can lead to severe consequences, like financial loss, litigations or can cause adverse \nreputation on a particular organisation. Verification processes make sure that each change made on a document is traced \nand identified, thereby con serving the original content and providing for clear audit trail. This is especially important in \nsuch areas where appropriate records are vital, that is, healthcare, finance, and legal services.  \nDocument verification is as well very critical in order to comply with regulatory requirements. There are a lot of industries  \nthat are subject to strict rules and regulations that require secure manipulation and accurate filling of a document. For \ninstance , financial institutions have to abide by anti -fraud measures, data protection laws; healthcare providers are to follow \nprivacy laws, such as HIPAA. Verification mechanisms provide organisations a means of showing that their adherence to \nsuch regulations i s kept through security in the management of documents and authentication of any changes made on it.  \nAlso, the digital transactions and online communications have added to the demand for a strong document verification. \nWith additional businesses and individuals transacting digitally, the number of possibilities of having forged and fake \ndocuments has also  gone up. Verification mechanisms like the digital signature and block chain technology ensures that one \ncan have a high level of security and trust since the document is original and unchanged since the inception for the same. \nThis boosts the confidence o f all the players in digital transactions which makes business transactions smoother.  \n \n1.2 Overview of blockchain technology in EDMS  \nBlockchain technology provides an innovative way of improving the Electronic Document M\nInternational Journal of Environmental Sciences   \nISSN: 2229 -7359  \n Vol. 11 No. 2, 2025  \nhttps://www.theaspd.com/ijes.php   \n \n740  \nFigure 1. Objectives of the review  \n \nThe review is meant to assess the benefits of security and privacy that are present with blockchain enabled EDMS. Through \nthe examination, the review wants to underline the importance of the mentioned features in ensuring trust and compliance \nin the market . In addition, the review shall provide operational tips from case studies and practicality of blockchain -enabled \nEDMS. These examples would depict the operability benefits and the implementation roadmap in the variety of industries, \nwhich would show the c apability of the technology to increase the efficiency and reliability of document management.  \nFinally, comparative analysis between blockchain -enabled EDMS and the traditional document management systems as well \nas other state of the art technologies such as artificial intelligence and cloud computing will be done in the review. This \ncomparison is meant to reveal the peculiar advantages and possible restrictions of an integration of blockchain in efforts to \nidentify future trends and directions in document  management systems studies.  \n \n2. LITERATURE SURVEY  \nElectronic Document Management Systems (EDMS) change the approach to digital document management in organisations \nas such systems offer effective storage, retrieval, and handling. To the core, EDMS are designed to eliminate the use of \ntraditional paper -based systems as well as its electronic substitutes to promote an improved management of documents and \neasier accessibility. Such systems make it eas ier to create, edit, share, and archive documents in an online centralised \nrepository, thus eliminating physical storage needs, as well as shortening the period that it takes to retrieve information. The \nEDMS have transformed over the years from mere docum ent storage method to complex ones that provide amazing features. \nAmong the features are version control whereby users will work with the latest versions of the documents and metadata \ntagging that improve searchability and organisation of documents. Anothe r important feature of workflow automation that \nautomates document -driven procedures like approvals and notifications and streamlines operations with less administrative \nloads.  The advantages of EDMS go beyond efficiency in the organisation to cover the as pects of security and compliance. \nEDMS offer substantial security detail to guard sensitive documents from unauthorised access and promote regulatory \nrequirements’ compliance. They also include audit trails and activity logs that trace the history of docum ents, helpful on \ncompliance audits and proceedings in court. On a whole, EDMS are quite essential in terms of revamping document \nmanagement processes such that organisations can maximise their output levels while maintaining efficiency and security of \ndata in the current digital wo\nInternational Journal of Environmental Sciences   \nISSN: 2229 -7359  \n Vol. 11 No. 2, 2025  \nhttps://www.theaspd.com/ijes.php   \n \n741 tampered with at all times in their lifecycles. This verification process entails comparing cryptographic hashes or digital \nsignatures related to documents to their original records kept in the blockchain hence verifying its validity.  Some of the \nmain concepts of this system are decentralisation, with the spreading of document data across several nodes or computers, \nthus making the system failure -free by removing single points of failures, and increasing system level of resilience. Cons ensus \nmechanisms, suc h as proof of work or proof of stake provide the agreement between the network nodes to the validity of \ntransactions or the changes of documents, thus, increasing the system’s security against fraud and manipulation. Generally, \na Blockchain -Enabled EDMS wi th integrated verification module is an attempt to increase security and transparency of the \ndocuments along with the effectiveness of process of managing documents. It builds on top of blockchain’s decentralised \nand immutable nature and makes use of cutti ng-edge methods of cryptographic verification to provide a reliable answer to \norganisations attempting to enhance their functionality regarding handling, authentication, and compliance of documents.  \n \n2.2 Components of an EDMS  \nAn Electronic Document Management System (EDMS) consists of various necessary parts, which jointly allow handling, \nstoring, and retrieving the digital documents efficiently. The Document Storage Repository is the base of an EDMS since it \nis the system of a  centralised database where digital files are safely kept. This repository allows storing different types of \ndocuments and metadata with the stress on an organised and scalable storage.  Document Capture and Import functionalities \nmake it possible for docum ents to be easily ingested into the EDMS. This refers to scanning of physical documents, \nimporting the electronic files and capturing metadata in order to support categorization and indexing of documents. These \nabilities make things easier when it comes to  digitising the documents and to incorporate the documents into the system.  \nDocument Indexing and Metadata Management are essential elements that make searching and retrieval of data handy in \nthe EDMS. Metadata like titles of documents, authors of documents, creation dates, and keywords are applied to the \ndocuments, which allows t he users to find and retrieve the desired information in a short time. Indexing and metadata \nmanagement are effective enough to make the organisation and retrieval of documents efficient.  Document Version Control \nmechanisms enable tracking of the changes t hat are done on documents with time thus the users access the latest versions \nof documents. Version control capabilities provide the functions of tracing the changes in documents, comparison of various \nversions and re\nInternational Journal of Environmental Sciences   \nISSN: 2229 -7359  \n Vol. 11 No. 2, 2025  \nhttps://www.theaspd.com/ijes.php   \n \n742 The conventional Electronic Document Management Systems (EDMS) mostly use centralised servers to store and manage \ndigital documents. On the other hand, Blockchain -empowered EDMS utilises the technology of decentralised blockchain \nto spread document data am ong nodes in the network. It is this decentralisation that removes single points of failure and \nincreases system resilience, which means that blockchain -enabled EDMS is less prone to a data breach and downtime. In \nthe conventional EDMS, documents prove the ir authenticity based on centralised authentication tools and controlled access \nas regulated by a central entity. But the Blockchain -enabled EDMS, however, make use of cryptographic hashing and digital \nsignature for verifying the integrity of documents sto red on the block chain. This decentralised verification process makes it \nimpossible for changes and alterations to be made on documents without being traced, heightening the amount of trust and \ntransparency.The security of documents in the classical EDMS i s usually maintained by access control lists and encryption \nmeans as well. Blockchain enhanced EDMS improves on security due to the immutability of the Blockchain that certifies \neach document transaction and has it stored through cryptographic linkages. Th is makes all the changes on every document \ntransparent and traceable minimising the cases of unauthorised changes. Scalability is another key difference. Scale -ability \nin traditional EDMS may become an issue as they attempt to increase their infrastructure  to cope with increased volume of \ndocuments and number of users. Blockchain -enhanced EDMS with distributed design provide higher scalability \nopportunities due to the use of the aggregate computing power of the network nodes that can expand the access to th e \nsystem without diminishing the system’s performance.  Traditional EDMS in most cases needs the use of a third party \nintermediary or trust in central authority in document verification and management. Blockchain -powered EDMS, that are \ndecentralised and tru stless, make the use of intermediaries less necessary, offer peer -to-peer transactions and verifications, \ncontribute to higher autonomy and efficiency of the document management processes.  \n \n3. BLOCKCHAIN TECHNOLOGY  \nBlockchain technology is based on some major principles that make it different from the centralised systems. Firstly, it is \ndecentralised, so to say that data is distributed across a set of computers rather than allocated in one place. Every node ha s \na replica of the whole block -chain, whi ch makes the system fault -tolerant and data -loss resistant.  Blockchain is based on the \nprinciple of the immutability. Once data are written on the block chain, it cannot be changed declared so in the future \nwithout agreement of majority of the network. Thi s feat"
  },
  {
    "file": "An Exploration of Zero-Knowledge Proofs and zk-SNARK(cocncept).pdf",
    "title": "Microsoft Word - zkSNARKs_draft.docx",
    "text": "   1               An Exploration of Zero-Knowledge Proofs and zk-SNARKs  Terrence Jo  EAS499  Fall 2019  Advisor: Professor David Crosbie     \n   2 Table of Contents  1. Abstract ........................................................................................................................ 3 2. Introduction and Overview of Zero-Knowledge Proofs ........................................... 4-6 3. Introduction to zk-SNARKs ........................................................................................ 6 4. Technical Overview of zk-SNARKs ...................................................................... 7-11 5. zk-SNARK in Application ................................................................................... 12-19 6. Challenges and Outlook ....................................................................................... 19-21 7. Conclusion .................................................................................................................. 21           \n   3 Abstract Over the past few years, with the rise of cryptocurrency prices and new blockchain startups, blockchain technology has become popular and a variety of use cases have become apparent – in banking, identification, cryptocurrency, supply chains, payments and more. With new developments in cryptography and privacy, related cryptographic technology is becoming more advanced and furthering its applications. One such recent development is zero knowledge proofs, and specifically zk-SNARKs (Zero Knowledge Succinct Non-interactive Argument of Knowledge), a new form of zero-knowledge cryptography. In this paper, first I will give an overview of zero-knowledge proofs, then investigate the emerging new technology of zk-SNARKs, why and how it works, and explore recent implementations and their efficiencies. Then, I will also explore the practicality and usability of zk-SNARKs in a business context, by investigating companies and startups that claim to use zero-knowledge proofs in their products. Finally, I will discuss current challenges in the development of zero-knowledge proofs and the future outlook.      \n   4 1. Introduction and Overview of Zero-Knowledge Proofs Zero-knowledge proofs are a very interesting and fascinating cryptographic concept and prove to be useful in various applications, mainly in privacy and blockchain technology. Zero-knowledge proofs involve two parties: a prover and a verifier. The prover makes an assertion that his or her proof is valid, which the verifier must approve, without the prover leaking any “knowledge” other than the assertion itself. How can the verifier validate an assertion without any knowledge of the content and minimal interaction with the prover? This is where zero-knowledge proofs become useful and can be used in many cryptographic protocols to “provide zero-knowledge proofs of correctness of... secret-based actions, without revealing these secrets”. 1 We can imagine use cases almost immediately – imagine frequent scenarios when one reveals private information to verify something about one’s identity. When one applies for a credit card, he or she must give up his social security number, or when one checks in for a flight at the airport, he or she must reveal all the private information present on the passport, such as birthdate or passport number. Even on a day-to-day basis, when a user logs on to a web or mobile application, the user must enter a password to the account and send this sensitive information to the server, trust that the application securely handles this information, and that the password is not intercepted over the network. Dr. Manuel Blum from the University of California, Berkeley suggested a zero-knowledge solution to this problem – the “password” could be an interactive “procedure”, such as changing letters in a string, rather than a string itself, through which the user proves knowledge of the “password” without leaking the password itself. 2 An outside observer would no longer have a string password to intercept and fraudulently log on to another user’s account. 2 So how do zero-knowledge proofs work and how are they structured? As mentioned previously, there is a “prover” and “verifier”. The “prover” wants to prove the knowledge of a solution to a specific problem (or truth of a statement), without leaking any knowledge of the solution itself to the “verifier”, who wants to be reassured that the prover actually does know the solution (or that the statement is true). According to Goldwasser, Micali, and Rackoff, who first introduced the “zero-knowledge” concept3, there are three main essential properties of zero-knowledge protocols: 1. Completeness: If statement is true, the verifier would be convinced of the truth of statement by the prover.  1 Goldreich, Oded. “A Short Tutorial of Zero-Knowledge.” Weizmann Institute of Science, 2010. 2 Gleick, James. “A NEW APPROACH TO PROTECTING SECRETS IS DISCOVERED.” The New York Times, The New York Times, 17 Feb. 1987, https://www.nytimes.com/1987/02/17/science/a-new-approach-to-protecting-secrets-is-discovered.html. 3 Green, Matthew. “Zero Kn\n   5 2. Soundness: The prover can only convince the verifier of the truth of the statement if that statement itself is actually true, except with some very small probability. 3. Zero-Knowledge: The verifier does not know any knowledge (zero knowledge) of the prover’s statement or solution that, other than the truth of the statement. 4 One of the first such valid general zero-knowledge proof systems was proposed by Goldreich, Micali, and Widgerson, specifically to verify that a prover knew the 3-coloring of a graph. The 3-coloring graph problem is an NP-Complete problem stated as follows: “Given a graph G, can you color the nodes with <3 colors such that for every edge {u, v} we have f(u) =/= f(v)?” 5 In this zero-knowledge proof system, the prover wants to prove to the verifier that he or she knows the 3-coloring of a given graph to a verifier, without revealing to the verifier the actual 3-coloring solution. Thus, the zero-knowledge proof system works in the following way:  1. The prover covers each vertex of a 3-coloring solution of the graph such that it is not observable to the verifier. 2. The verifier randomly chooses an edge of the graph and the prover reveals the two vertices of the chosen edge. The prover shows that the two vertices are of a different color. If the two vertices are of the same color, we know that the prover is dishonest and does not have the solution. If the two vertices are of different color, the verifier has some (but not full) confidence that the prover is telling the truth. We note that the prover has (E-1)/E probability of cheating, where E is the number of edges in the graph. Then we continue to the next step. 3. The prover now covers all vertices of the graph again, and randomly switches the ordering of the three colors in the prover’s solution. Again, the verifier then chooses a random edge to check that the edge is valid (the two vertices are of different colors). Although the prover could be cheating again, we see that now the probability that the prover successfully cheated both rounds is ((𝐸−1)/𝐸)∗((𝐸−1)/𝐸)=((𝐸−1)/𝐸)^2, which is lower than the previous round. 4. After repeating this process for multiple n rounds, we can lower the probability that the prover can cheat the verifier, to a negligible value. 6 a. Probability of Prover Cheating: +,-.,/0.\t   One of the most important aspects of this protocol proposed by Goldreich, Micali, and Widgerson is the zero-knowledge aspect – we have to show that the verifier cannot identify the actual solution to the 3-coloring solution. This is where the randomness of the coloring at each round comes in. If at each round, the order of the coloring of the vertices of the graph is different, the verifier cannot link the edges revealed between subsequent rounds to construct a  4 Goldwasser et al. “Interactive Proof Systems.” Computational Complexity Theory Proceedings of Symposia in Applied Mathematics, 1989, pp. 108–128. 5 https://www.cs.cmu.edu/~ckingsf/bioinfo-lectures/sat"
  },
  {
    "file": "CredenceLedger_A_Permissioned_Blockchain_for_Verifiable_Academic_Credentials.pdf",
    "title": "CredenceLedger: A Permissioned Blockchain for Verifiable Academic Credentials",
    "text": "978-1-5386-1469-3/18/$31.00 ©2018 IEEE \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001 2018 IEEE International Conference on Engineering, \n                                                                                                                                                          Technology and Innovation (ICE/ITMC) CredenceLedger: A Permissioned Blockchain \nfor Verifiable Academic Credentials \n \nRodelio Arenas \nDepartment of Information Systems and Computer Science \nAteneo de Manila University \nManila, Philippines \nrodelio.arenas@obf.ateneo.edu Proceso Fernandez \nDepartment of Information Systems and Computer Science \nAteneo de Manila University \nManila, Philippines \npfernandez@ateneo.edu \n \n \n \nAbstract—Blockchain, the underlying technology that powers \ncryptocurrencies   such   as  Bitcoin   and   Ethereum,   is  gaining \nso much attention from different industry stakeholders, \ngovernments  and  research  communities.  Its  application  is \nextending beyond cryptocurrencies and has been exploited in \ndifferent  domains  such  as  finance,  E-commerce,   Internet  of \nThings (IoT), healthcare, and governance. Some key attributes of \nthe technology are decentralization, immutability, security and \ntransparency. This paper aims to describe how permissioned \nBlockchain can be applied to a specific educational use case — \ndecentralized verification of academic credentials. The proposed \nBlockchain-based solution, named ‘CredenceLedger’,  is a system \nthat stores compact  data proofs of digital academic  credentials \nin Blockchain ledger that are easily verifiable for education \nstakeholders and interested third party organizations.  \nIndex    Terms —Blockchain,    Cryptocurrency,    Decentralized  \nV erification, Stream, Mining  \n \nI.  I NT ROD UCT ION  \n \nAs early as birth, there is a need to document people and ensure \nthat these documents are verifiable. These documents that  \nprove  authenticity  of what  has been  achieved  continue to file \nup as people move towards gaining educational attainments,  \ntraining  certifications and  work  experience records. Use of \nfake documents  has been  a problem for so many years. \nNowadays, forging ‘paper- based’  documents to produce replicas \nof the authentic or official copies can be done in just a couple of \nhours. At worst, in the absence of a security mechanism in place, \nfraudulent copies of ‘digital- based’ credentials can be fabricated \nat enormous speed. \nIn 2009, Judge Jenny Lind Aldecoa-Delorino filed a case \nagainst  a  court  clerk  who  falsified  the  school  records  to \nqualify for the job [1]. At MIT, a similar matter forced former \nDean of Admissions, Marilee Jones, to quit her job when she \nadmitted that for nearly three decades at the institution, she \nrepresented herself as having three degrees from different New \nY ork institutions  when in fact, she had not achieved  any of \nthese [11]. Such shortcomings could have been avoided if, in \nthe case of Marilee Jones\n978-1-5386-1469-3/18/$31.00 ©2018 IEEE \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001 2018 IEEE International Conference on Engineering, \n                                                                                                                                                          Technology and Innovation (ICE/ITMC) be applied. Therefore, document verification is a slow process \nand can be hard or easy depending on the institution. In the \nsame manner, a media company [13] describes the hardships \nand laborious effort they invest in fact-checking the academic \ndegrees of some politicians. \nThe solution proposed in this paper for the decentralized \nverification of academic credentials relies on a permissioned \nBlockchain-based technology specifically the open source \nMultichain  [17].  Blockchain  is  a  fast-growing  technology \nthat powers Bitcoin and other cryptocurrencies, forecasted to \ndisrupt any traditional  services  because  of the decentralized \nand distributed  nature.  Blockchain  can  be  used  as  a \ntransparent and trusted system for securing, sharing, and \nverifying  academic  credentials.  Blockchain  also  represents \nan opportunity for third parties such as employers, to \nindependently and privately verify shared academic proofs. \n \nII.  B LO C K CH A I N TEC HNO LOG Y \n \nBlockchain  is  a  decentralized  ledger  that  records  history \nof information  from a group of validated transactions  called \n’block’.  Each  block  is  timestamped  and  cryptographically \nlinked  to  a  previous  block  forming  a  chain  of  immutable \nrecords that are distributed, shared and maintained across \nmultiple nodes on a P2P network. In order to add a block into \nan ongoing chain, an extremely difficult mathematical proof \ncalled ’mining’  is required to confirm transactions.  A block \ncan only be verified based on synchronous consensus of the \nminers. \n \nA.  Blockchain   1.0:   Bitcoin   Cryptocurrency   and   Public  \nBlockchain  \n \nBitcoin   is   the   first,   largest   and,   arguably ,   the   most \nsuccessful implementation of Blockchain. It is also the first \ncryptocurrency continuously operating on public Blockchain \ninvented in 2008 [12], by Satoshi Nakamoto, a pseudonym. \n1) Blockchain    Data    Structure:     Blockchain    is    a \ndecentralized append-only database or ‘ledger’  for \ncryptographically    linked    blocks    of    transactions, each \npointing to a previous or parent block.  A block that has \nno parent is the ‘genesis block ’ which also constitutes the first \nand foundation block in the Blockchain.  Likewise, the most \nrecently added block in an ongoing chain is called ‘top block’.  \nEach block is made up of a header and body . A ‘block header’  \nconsists of three metadata: (1) previous block hash; (2) mining \nmetadata — difficulty , timestamp and nonce; and (3) merkle \nroot. Block aggregates and validates transactions for inclusion \nin the ‘block body’.  A block ’s primary identifier is a 32-byt\n978-1-5386-1469-3/18/$31.00 ©2018 IEEE \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001 2018 IEEE International Conference on Engineering, \n                                                                                                                                                          Technology and Innovation (ICE/ITMC) problem   based   on   a   cryptographic   hash   algorithm,   that \nconsumes a lot of electricity . The estimated difficulty level, at \nthe time of this writing, is 25,517,998.11 TH/s (tera hashes or \ntrillions of hashes per second) [33], which is regularly adjusted \nby the public Blockchain network to maintain a steady rate of \nminting the cryptocurrency. \n5)  Cryptography  and Security:  Asymmetric  cryptography \nis  used  when  storing  transaction  data  in  a  Blockchain  by \ndigitally signing them so that only intended users can open or \nread the contents, thus, forming a chain of digital signatures. \nThis process makes it possible for anyone to verify every \nsignature on every transaction while ensuring that only the \nowners of private keys can produce valid signatures. \n \nB.  Blockchain      2.0:      Smart      Contracts      and      New  \nCryptocurrencies  \nThere are many next-generation public Blockchains developed \nand launched [26]. A ’smart contract’  is a general-purpose \nprogram that can be executed on a Blockchain. It was \npopularized by Ethereum [27], a public Blockchain associated \nto a cryptocurrency called ’ether’.  \n \nC.  Blockchain 3.0: Beyond Cryptocurrencies  \nWhile Bitcoin and Ethereum top the cryptocurrency market \n[26], many private or permissioned Blockchains such as \nMultichain [17], provided more Blockchain potential use cases \nthat impacted many domains such as financial institutions, \ngovernments, corporates and cross-industries [14]. \n \nD.  Blockchain 4.0: Blockchain-as-a-Service (BaaS)  \nOpen Source communities, technology giants and start-up \ncompanies are investing heavily in Blockchain solutions. IBM \ndeveloped  its  own  BaaS  based  on  Hyperledger  [25],  an \nopen source Blockchain framework that resulted from global \ncollaborative  efforts  initiated  by  the  Linux  Foundation  and \n130+ technology leaders. Likewise, Microsoft expanded their \nsupport to Ethereum-based BaaS powered by Azure. \n \nE.  Existing    Blockchain-based     Solutions    for    Academic  \nCredentials  \nGrech et. al.1  reported several use cases where Blockchain \ntechnology can be adopted in education context [18]. \nDecentralized verification of academic credentials is just one \nof  the  many  potential  use  cases.  Relatively ,  listed  below \nare some solution vendors already offering Blockchain-based \nservices to education sector that may be applicable to \ndecentralized verification of academic credentials: \n1)  BlockCert:   BlockCert  is  an  open source  software  that \nany university or institution can use to issue credentials using \nBitcoin Blockchain. It was developed by MIT Media Lab in \nco\n978-1-5386-1469-3/18/$31.00 ©2018 IEEE \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001 2018 IEEE International Conference on Engineering, \n                                                                                                                                                          Technology and Innovation (ICE/ITMC) writing to the database, there also needs to have some degree \nof mistrust between those writers. For example, one user is not \nwilling to let another modify database entries which it owns. \nA well-known solution to this problem of enabling a database \nwith multiple non-trusting writers is a trusted intermediary or \nsimply , a centralized database. \nMany  systems  are  filled  with  databases  of  this  nature, \nsuch as the ledger of accounts in a bank. The bank controls \nthe database and ensures that every transaction is valid and \nauthorized by the customer. \n \nD.  Permissioned Blockchain  \nPermissioned Blockchain inherited many good features from \npublic or permissionless Blockchain with added functionalities \nideal  to  closed  or regulated  systems  that  operate  according \nto a set of rules or permissions. It also addresses several \nshortcomings of a public Blockchain related to: consensus \nmechanism and mining risks; access and participation; and \nprivacy. \nThe participating Blockchain nodes are added on a ’by \ninvitation’  process which is a common interest in the network. \nCorrespondingly , the Blockchain ledger will only contain \ntransaction data relevant to those participants. Arguably, \npermissioned Blockchain tends to be more efficient in terms \nof: high transaction throughputs, and low costs and resources \nconsumption. \n \nE.  CredenceLedger  \nCredenceLedger    is    a    proposed    permissioned \nBlockchain-based    platform   for   decentralized    verification \nof academic credentials. \n \n \n \nFig. 1.  CredenceLedger  Mobile Application. \n \n \nThis software platform is based on Multichain with the \naddition  of the CredenceLedger  mobile application,  offering \nthe  students  the  option  to  be  awarded   authentic   digital version of their credentials  when they graduate,  in addition \nto  receiving  the  paper-based  version  of  the  credentials.  By \nusing  the  mobile  app,  the  students  can  quickly  access  a \ndigital  credential  that  can  be  easily  verified  by  interested \nthird parties such as employers, to ensure its authenticity and \nshared on social media. The digital credentials are protected \nusing Blockchain ’s built-in security features which means that \nlimited information (compact data proofs) will be available to \ninterested third parties. Other information is encrypted and will \nonly be available upon request subject to recipient ’s approval. \nDecentralized verification of authenticity and recipient ’s full \ncontrol  over  their  privacy  are  the  two  important  aspects  of \nthis solution. \n \n \n \n \n \nFig. 2.  CredenceLedger  Architecture. \n \n \n \nAll privileges provided \n978-1-5386-1469-3/18/$31.00 ©2018 IEEE \u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001 2018 IEEE International Conference on Engineering, \n                                                                                                                                                          Technology and Innovation (ICE/ITMC) Feature  Permissioned  Permissionless  \nOpen to everyone  No Yes \nScalability  Yes No \nLow storage cost  Yes No \nSmaller chain  Yes No \nSoftware \nSolution  Blockchain \nImplementation  Require \nCryptocurrency  Streaming \nData Open \nSource \nBlockCert  Blockchain \nthrough the \nmining process \nas Bitcoin \ntransaction.  Yes No Yes \nOpen \nCertificate  Blockchain \nin     form     of \na Smart \nContract.  Yes No No \nGradbase  Bitcoin \nBlockchain \nwith an option \nfor custom \ntransaction.  Yes No No \nStampery  Bitcoin \nBlockchain \nand   Ethereum \nproof Yes No No \nCredence \nLedger Multichain \nwith \nmultisignature.  No Yes Yes \nAccess Blockchain  Centralized \nClient Centralized \nServer \nRead mine  Yes Yes Yes \nRead all  Yes No Yes \nWrite mine  Yes Yes Yes \nWrite all  No No Yes  \n \n C.  Permissionless vs. Permissioned Blockchain  \nThe main difference of a permissioned Blockchain, like the \nproposed CredenceLedger, from public or permissionless \nBlockchain are the following features shown in Table III. In \nCredenceLedger, permissions are added to every transac tion’s \nmetadata using stream.\n \nTABLE III \nFEA TU  R ES  O F PER M I S SI O N LE SS A N D PER M I S SI O N ED BLO C K CH A I N [18] \n \n \nIV.  A NA LY S I S \n \nA.  Paper-based vs. Digital Academic Records  \n \nThe  paper  format  issued  by  schools  and  universities  has \na  minimum  turnaround  time  of  three  days  [20]  up  to  one \nmonth  [21].  If  the  student  or  former  alumni  would  like  to \nstudy or work abroad, these documents should be authenticated \nthrough Department of Foreign Affairs, a process called Red \nRibbon  which  usually  takes  four  days  [23].  If  the  purpose \nof the documents is for local use, the processing time is 10 \nminutes [22]. Certificates and documents from schools are in \npaper format even though digitalization of the school system \nis being practiced. The characteristics of the paper format that \ncould be improved in the proposed CredenceLedger are shown \nin Table I . \n \nTABLE I \nCHA RACT ER IST ICS  OF PAP ER -BA S E D A N D D I G I TA L C R E D E N T I A L S  \n \n \n \n \nD.  CredenceLedger vs. Other Blockchain-based Solutions  \nIt  could  be  observed   on  Table   IV  that  the  available \nBlockchain implementation for education is using Bitcoin ’s \ntransaction for asset. On the other hand, the proposed \nCredenceLedger implements streaming through Multichain for \nthe privacy of the school documents. All other source code is \nproprietary except for BlockCert and CredenceLedger. \n \nTABLE IV \nEX I S TI N G S O F TWA R E I M P L E ME N TAT I ON O F BL O C K C H A I N I N E D UC ATI O N \n \nCharacteristics  of  a \nCertificate  Paper-ba"
  },
  {
    "file": "IDStack__The_common_protocol_for_document_verification_built_on_digital_signatures.pdf",
    "title": "Microsoft Word - 46 PID4955743Lakmal-046 (1).docx",
    "text": "2017 National Information Technology Conference (NITC), 13 -15 September, Colombo, Sri Lanka  \n978-1-5386- 2425- 8/17/$31.00 ©2017 IEEE  \n 96 IDStack - the Comm on Protocol for Docum ent \nVerif ication Built on Digital Signa tures \n \n \nChana ka Lakmal1, Sachit hra Dangalla2, Chan du He rath3, Chamin Wickramarathna4, Gihan D ias5, Shantha F ernando6 \nDepartment of Computer Science and Engineering, University of Moratuwa,  \nMoratuwa, Sri Lanka \n1ldclakmal@gmail.com, 2sachithradangalla@gmail.com, 3cbherath93@g mail.com, 4chaminbw@gmail.com, 5gihan@uom.lk, \n6shantha@cse.mrt.ac.lk  \n \n \nAbstract — The use of physical docu ments is inconvenient and \ninefficient in today’s  world, which motivates us to move towards the \nuse of digital documents. Digital docu ments can solve many \nproblems of  inefficiency  of data  man agement but  proving  their \nauth enticity and verifying them is still a problem. This paper \npresents a solut ion for this pr oblem using text extraction, digital \nsignatures and a correlati on score for a set of docu ments. The \npaper discusses the impa cts and adva ntages of the proposed \ntechnol ogies against other possible technologies that could serve \nthe same purpose. \n \nKeywords— docu ment verification; digital signature; data \nextraction;  docment   correlation   score;   docu ment  confidence \nscore; machine- readable; protocol; api; module; web service; json \n \nI.   INTRODUC TION \nUse of physical documents is cumbersome, and the world is \nmoving towards  the use of digital documents. Dig ital \ndocuments a re co nvenient to use, but proving their  \nauthenticity is  often  a problem. Since there is no common \nprotocol to validate a nd verify digitized documents, th e process \nof analyzing the documents in private and government \ninstitutions is difficult. \n \nIf there is a mechanism to  verify the authenticity of \ndocuments and to validate the authenticity a nd content of the \ndocuments, it would facilitate users to manage their digital \ndocuments. Using a score to determine how much a document \nis validated and how much a set of documents rela te to a user, \ncan be useful. It would provide an alternative support for the \nuser to determine whether to trust the document or not. This \npaper  discusses a proposed solution for the above mentioned \nproblems. IDStack is a system based on digital signature \ntechnology to verify digital documents, which  provides a \nconfidence score to a document and a correlation score to a set \nof documents. \n \nThis paper is structured as follows. Section II introduces the \nmotivation for the proposed model and Section III discusses \nthe literature of existing technologies th at were reviewed and \nselected or not selected for the proposed  system  with \njustifications for doing so . Secti on IV explains the proposed \narchitecture an d the execution model of the system an d \nSection V discusses future enha ncements that could fine-tune \nthis system. \n \nII.  MOTIVATION AND BACKGROUND \nIn countries li ke \n97 ensures the proof  of existence, integrity, ownership, and the \nreceip t of a given document. \n \nShoCard is one of the systems developed using blockchain \ntechnology for proving a user’s identity when dealing with \nonline systems [6]. Each user is given a credi t score, and \nbased on a defined qualificatio n, (e.g. credit score>70 0) \ninstitutes can qualify the user identities. It has stated that the \nusers can give banks and other organizations temporary access \nto the private sections of his blockchain records to verify his \nidentity. But in ShoCard, as the final security step, a trusted \nthird-party organizatio n such as a financial institution or the \ngovernment may need to certif y the user’s identity, which \ncould result in difficulties in practice.  \n \nBlocksign is another blockchain based service for legally \nsigning any docum ent, contract, or agreement [7]. It also \nhashes the docum ent and stores it in a blockchain. But in such \na system, verifying a document soon after signing is not \npossible  because adding a transaction to a blockchain needs to \ngo throug h several stages. To achieve the authenticity, \nBlocksign stores user accoun t details such as email addres s \nalong with the cryptographic hash. Integrity is  achieved by \ncomparing the hash values in the verifying process.  Web \napplicatio ns such as “ProofOfExistence” also work based on \nthe above principle [8]. \n \nBy reviewing the above implementations , it was observed \nthat a signing and verification system needs either blockchain \ntechno logy or PKI based digital signatures but not both. \nAlthough  blockchain  provides  integrity,  to  achieve \nauthenticity, the blockchain based docum ent verification \nsolutions need to manage user accounts. But in PKI system the \ncertificate  itself has the signer’s information. Therefore, it was \ndecided to us e PKI in the proposed system. \n \nAnother objective of the system is to extract information \nfrom  a  docum ent.  The  designed  protocol  in  this  system \nextracts  information from a pdf docum ent to the json format. \nDocpar ser   is   one   of   the   services   which   converts   pdf \ndocum ents to machine readabl e formats such as json, csv, xml \netc. [9] The designed  protocol extracts information from a pdf \ndocument  in  a  similar  kind  of  way.  A  machine  learning process helps the extraction by automatica lly identifying the \nfields such as name and address . \n \nIV. ARCH ITECTURE AND IMPLEMENTATION \n \nA.  Modularized Architecture \nIDStack is a decentralized API stack that can be used by \ncitizens through a client application of their own that can call \nthe IDStack protocol. The protocol is implemented in \nmodularized architecture, which has three unique and different \nmodules, which are focused on three different applications   \nconnected to  the  IDStack  web  service as  illustrated in \n[Fig. 1.] \n \n1.    Data  extraction module \n2.    Data  validating module \n3.    Score calculating module \n \n \n \n \nFig. 1.  IDSta\n98 \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n \nFig. 2.  IDStack protocol \n \n1) Machine-Readable Document: \nThe  machine-readable document  is  a  JSON  file  which \ncontains the  content  of  the  docum ent in  a  key  value  pair \ndesign. Apart from that, the digital signature related  attributes \nof the extractor  and the set of signers are also included into the \nsame JSON  docum ent. \n \n2) User Roles vs Modules: \nThe identified roles of users and the respective modules \nused is presented in [Table 1.] \n \n \nB.  IDStack Protocol \nA citizens who has a document in digital or physical \nformats (so called  owners of the docum ent) requests an \nextractor to verify and digitize it. The extractor digitizes  the \ndocum ent  and  creates  a  machine-readabl e docum ent  using \nIDStack saying that the physical or the digital docum ent and \nthe machine-readab le docum ent are 100%  matching with each \nother, and then he or she digitally signs with his or her  own \nsignature. The machine-readab le docum ent can be signed with \nany number of validators with their digital signatures. That \nsignature may validate  a previo us signature or any part of the \ncontent of the docum ent or both. Then those signed  machine-\nreadab le docum ents can be viewed by the relying party with \nan automated real-time scoring mechanism which calculates a \nscore  based  on  the  signatures  and  the  correlati vity of  the \ndocument parameters. This protocol is illu strated in [Fig. 2.] \n \n \nV.  CONC LUSION AND FUTURE WORK \nThe need for a better solution for document verificatio n in \nthe Sri Lankan context is clear and expanding. With the \nadvancement in the use of digital documents, document \nverification  has  a  very  good  potential  to  grow  in  many directio ns.  IDStac k  has  proposed  and  successfully \nimplemented a  solution that uses digital signatures, text \nextraction and document correlation to address the \naforementioned issue. \n \nThe system is deploy ed, and  the API stack is available \nonline [10] and the system has successfu lly achieved the \nfunctional and nonfunctional requirements. The following \nfuture contributions a re potential gateways that could take the \nsystem to the next level. \n \nA.  Langua ge Support \nCurrently,  IDStack  suppor ts  only  English  docum ents, \nwhich does not satisfy the popu lar demand of the general Sri \nLankan docum ents. Therefore, the next update would be to \nsuppor t multiple  languages, primarily Sinhala and Tamil \nlanguages. \n \nB.  Data Extraction \nThe scope of the current system limits the input docum ents \nof the system by allowing only text-based pdf docum ents. One \nof  the  future  updates is  to  suppor t  multiple text  files,  and \nanother major update is to suppor t image proce ssing and OCR \nto extract data from image files. \nAnother limitation of the system is the use of prede fined \ndocument templates that map the extracted  data of the input \ndocum ent to  information in  machine-readabl e format.  The \ncurrent syste\n \n978-1-5386- 2425- 8/17/$31.00 ©2017 IEEE  \n 99 issued  by a  reputed  Certificate Authority, but it would  be \ncostly   in   the   context   of   the   system's   target   audience. \nTherefore, an important future work of the system is to find a \ndigital signing mechanism that would suppor t strong identit y \nverification while also being cost-efficient. \n \nD. Docume nt Score \nIn the current system, the score per docum ent is based on \nthe signatures on the docum ent. An update for this could be to \nfine-tune the scoring mechanism to consider the docum ent's \nfeatures such as spellings and semantics to calculate a better \nconfidence score for the docum ent. Furthermore, the score \ncalcu lation could be acco mpanied by a validator's  comment, \nwhich  would  give  a  human  score  to  the  document, and \nwould thus  increas e the accuracy of the score. \nThe research  done on the correlatio n score of a  set of \ndocuments is to be continued to find a better-fitting score to \nthe document's true correlation stat us using machine learning \nand information retrieval approach es. REFEREN CES \n[1]    \"Digital signature\", En.wikipedia.org, 2017. [Online]. Available: \nhttps://en.wikipedia.org/wiki/D igital_signature. \n[2]    \"Don't settle for less. Choose the #1 eSignature brand.\", DocuSign, \n2017. [Online]. Available: https://www .docusign.com \n[3]    L. I. C. G. Adán Sánchez de Pedro Crespo, \"Stampery Blockcha in \nTimestam ping Architecture,\" [Online]. Available: \nhttps://s3.amazonaws.com/stampery-cdn/docs/Stampery-BTA-v5- \nwhitepaper.pdf. \n[4]    S. Nakamoto, \"Bitcoin A Peer-to-Peer Electronic Cash System\", 2017. \n[Online]. Available: https://bitcoin.org/bitcoin.pdf. \n[5]    \"Ethereum Project\", Ethereum.org, 2017. [Online]. Available: \nhttps://www .ethereum.org/. \n[6]    \"ShoCard | Identity for a Mobile World\", Shocard.com, 2017. [Online]. \nAvailable: https://shocard.com/. \n[7]    \"BlockSign\", Blocksign.com, 2017.  [Online]. Available: \nhttps://blocksign.com/. \n[8]    \"Proof of Existence\", Proofof existence.com, 2017. [Online]. Available: \nhttps://proofofe xistence.com/ \n[9]    \"Docparser - Extract Data From PDF to Excel, JSON and Webhook s\", \nDocparser.com, 2017. [Online]. Available: https://docparser.com/ \n[10]  \"IDStack API · Apiary\", Docs.id stack.apiary.io, 2017. [Online]. \nAvailable: http://docs.idstack.apiary.io/ \nAuthorized licensed use limited to: BML Munjal University. Downloaded on November 25,2025 at 05:29:43 UTC from IEEE Xplore.  Restrictions apply. "
  },
  {
    "file": "Long-term verification of signatures based on a blockchain.pdf",
    "title": "Long-term verification of signatures based on a blockchain",
    "text": "Computers  and Electrical  Engineering  81 (2020) 106523 \nContents  lists available  at ScienceDirect  \nComputers  and Electrical  Engineering  \njournal  homepage:  www.elsevier.com/locate/compeleceng  \nLong-term  veriﬁcation  of signatures  based  on a blockchain  /p82 \nTomasz  Hyla ∗, Jerzy Peja ´s \nWest Pomeranian  University  of Technology  in Szczecin, Faculty of Computer  Science and Information  Technology,  ul. ˙Zołnierska  52, \nSzczecin 71-210, Poland \na r t i c l e i n f o \nArticle history: \nReceived  23 October 2018 \nRevised 6 September  2019 \nAccepted  25 November  2019 \nAvailable  online 2 December  2019 \nKeywords:  \nDigital signature  \nSignature  veriﬁcation  \nValidity model \nBlockchain  \nTimestamp  a b s t r a c t \nDigitally  signed documents  must remain stored for many years. In this paper, a scheme \nthat would allow maintaining  signature  validity without  the necessity  to use timestamps  \nfrom trusted third parties is proposed.  According  to the scheme,  after inserting  data into \na blockchain,  a user can store a signed document  in his storage without  the need to per- \nform any maintenance  actions in the future. The Round-based  Blockchain  Time-stamping  \nScheme  is proposed  that is scalable,  i.e., it requires  embedding  a constant  number  of bytes \ninto a blockchain  independent  from a number  of input documents.  The scheme allows to \nprove that a document  existed not only before a certain date, but after a certain date as \nwell. Moreover,  the purpose  of the scheme is to meet non-repudiation  requirements  for \ndigitally  signed documents.  The scheme allows verifying  signature  validity using a chain \nmodel and under some conditions  using a modiﬁed  shell model. \n©2 0 1 9 Elsevier  Ltd. All rights reserved.  \n1. Introduction  \nMany signed digitally  documents  must remain  stored for many years. Digital signatures  are valid as long as the certiﬁcate  \nof a signer’s  public key is valid (usually  two years). Any additional  actions  must be taken to enable veriﬁcation  in a longer \nperiod (20 or more years). The simplest  one is to add a trusted  timestamp  immediately  after signing  a document.  Several  \ntrusted  authorities  offer such on-line  services.  A timestamp  is a digital signature  of a hash of a signed document  and current  \ntime that is created  by a Trusted  Authority  (TA). Therefore,  it will also expire. Hence, any long-term  archive  that uses trusted  \ntimestamps  to maintain  validity  of digital signatures  must periodically  re-timestamp  all documents.  \nNowadays,  blockchain  technology  has become  very popular,  what is mainly  caused  by introducing  Bitcoin  cryptocurrency  \n[1] . In practice,  cryptographic  techniques  which are used to build a blockchain,  i.e. hash functions,  hash linking,  hash trees \nand authenticated  dictionaries  have been known  for many years. The basic property  of a blockchain  is immutability,  i.e., the \nblockchain  ledger contains  permanent\n2 T. Hyla and J. Peja ´s / Computers  and Electrical  Engineering  81 (2020) 106523 \nit is computationally  impossible  to change  a blockchain  used by a popular  cryptocurrency  under the condition  that no one \nhas more than 50% of the computing  power. \nIn contrary,  the permissioned  blockchains  work in private  networks,  where participants  are whitelisted  [2] . The per- \nmissioned  blockchains  usually  use Practical  Byzantine  Fault Tolerance  (PBFT) algorithm  as a consensus  mechanism.  A good \nexample  of a permissioned  blockchain  implementation  and evaluation  was described  in 2019 by Knirsch  et al. [4] . More- \nover, the data in a blockchain  can be stored using two approaches.  In ﬁrst, data are embedded  into a blockchain  (on-chain  \nstorage).  In second,  hashes of records  are embedded  into a blockchain  (off-chain  storage).  \nThe ﬁrst solution  that allows eliminating  re-timestamping  operation  was to publish  periodically  a hash from a current  \nblock on a trusted  third-party  website  or print in a daily newspaper  [5] . A few years after Bitcoin  was introduced  several  \nsolutions  that use Bitcoin  to permanently  store a hash were presented.  Mainly,  because  it is possible  to read the time \nwhen each block in a blockchain  was mined.  Because  of that, when it is possible  to insert a hash from a document  into \na cryptocurrency  blockchain,  then block mining  time can act as (trusted)  timestamp.  In 2012, Clark and Essex [6] showed  \na general  approach  to carbon  dating and proposed  CommitCoin.  Stavrou  and Voas [7] analysed  different  approaches  for a \nblockchain  that can be used for timestamping  purposes.  \nSeveral  techniques  of data insertion  into Bitcoin  were proposed  and reviewed  by Sward et al. [8] , e.g. inserting  a hash \nas a Bitcoin  address  in a transaction  (what in fact is a hash of a user public key). Gao and Nobuhara  [9] also proposed  \nstoring  data in a blockchain  by encoding  it into Bitcoin  address.  In their experiments,  the transactions  were recorded  in \napproximately  24 min with a minimum  cost of 0.0 0 05BTC. Currently,  a few commercial  services  that allow to embed  a \nhash into Bitcoin  exist, e.g. BTProof,  po.et , or OrginStamp  . One of the most advanced  projects  that allow timestamping  using \nBitcoin  is OpenTimestamps  project  [10] that uses Merkle  hash trees to aggregate  data before embedding  it into Bitcoin.  The \npurpose  of the OpenTimestamps  is to provide  a scalable  timestamping  service.  \nMoreover,  other cryptocurrencies  can be used to embed  a hash into a blockchain  using a simpler  approach,  e.g., smart \ncontracts  in Ethereum.  Such an application  of smart contracts  is used as an example  in Ethereum  tutorials.  Execution  of a \nsmart contract  function  that changes  it state requires  payments  using Ethereum  gas. Additionally,  there are several  possible  \nattacks  and problems  related  to smart contracts  [11] that\nT. Hyla and J. Peja ´s / Computers  and Electrical  Engineering  81 (2020) 106523 3 \nto OpenTimestamps,  although  one might argue if OpenTimestamps  fulﬁl that property  as it is based only on Bitcoin  that has \nonly Probabilistic  Finality  property.  \nThe main advantage  of RBTS scheme,  comparing  to XML Advanced  Electronic  Signatures  (XAdES)  and RFC 4998 Evidence  \nRecord  Syntax (ERS) that are current  mainly  used solutions  to the problem  of prolonging  signature  validity,  is that after \ninserting  data into a blockchain,  a user can store a signed document  in his storage  without  the need to do any maintenance  \nactions  in the future, except monitoring  security  of cryptographic  algorithms  (like in current  Public Key Infrastructure  (PKI)). \nThe scheme  is scalable,  i.e., it requires  embedding  a constant  number  of bytes into a blockchain,  independent  from a number  \nof input documents.  The scheme  allows verifying  signature  validity  using Chain Model and under some conditions  using \nModiﬁed  Shell Model . Moreover,  the scheme  satisﬁes  non-repudiation  requirement  for digitally  signed documents.  \n1.2. Paper structure  \nThe rest of this paper is organized  as follows.  In the following  section,  models  of signature  veriﬁcation  in the long period \nare brieﬂy reviewed.  The Section  3 contains  informative  description  of the proposed  scheme,  a scheme  deﬁnition,  its security  \nmodel, and detailed  scheme  description.  In Section  4 , a security  analysis  and a performance  evaluation  are described.  Finally,  \nthe study’s  conclusions  are presented.  \n2. Preliminaries  \nNowadays,  three validity  models  can be used to verify digital signature  [16] : shell model, modiﬁed  shell model and chain \nmodel . In all models  a signature  must be mathematically  correct;  they differentiate  in a way how a chain of certiﬁcates  is \nvalidated.  In the shell model , veriﬁcation  time is a basis for the validation  decision.  In the modiﬁed  shell model , the signing  \ntime is a basis for the validation  decision  (if a signature  is valid at signing  time, it remains  valid for all time). In the chain \nmodel all certiﬁcates  in a certiﬁcate  chain must be valid at a time when a subordinate  certiﬁcate  was issued.  In a situation  \nwhen in a subordinate  certiﬁcate  validity  period is shorter  or equal to a root certiﬁcate  validity  period,  the validation  in \nboth models  will be identical.  The formal deﬁnitions  for the models  are [16] : \nDeﬁnition  1. (Modiﬁed  Shell Model)  A digital signature  is valid at veriﬁcation  time T v if all certiﬁcates  in the certiﬁcation  \nchain are valid at T s : T i ( k ) ≤T s ≤T e ( k ) for all 1 ≤k ≤N and no certiﬁcate  is revoked  at T s . \nDeﬁnition  2. (Chain Model)  A digital signature  is valid at veriﬁcation  time T v if: \n1. The end-entity  certiﬁcate  Cer ( N ) is valid at the signing  time T s : T i ( N ) ≤T s ≤T e ( N ) and Cer ( N ) is not revoked  at T \n4 T. Hyla and J. Peja ´s / Computers  and Electrical  Engineering  81 (2020) 106523 \nFig. 1. A diagram of a round-based  blockchain  timestamping.  \nBlockchain  Archival  Object (BAO) that is send back to a user or a storage  system.  As long as a blockchain  is considered  \nsecure,  no further  security  maintenance  actions  are required.  The system  is easy scalable  as a number  of transactions  send \nto a blockchain  is constant.  \nThe insertion  to a blockchain  could be done in several  ways. In permissioned  blockchains,  the data are inserted  according  \nto the blockchain  speciﬁcation.  In a cryptocurrency  (only when the cryptocurrency  fulﬁls all security  requirements),  a hash \ncan be inserted  as a hash of a public key of a transaction’  recipient.  The cost of a transaction  is a commission  for miners  \nand burned  coins that are sent to a non-existing  address.  The LTA monitors  the transaction  until it is inserted  by miners  \ninto a block and j following  blocks are mined.  If the transaction  is rejected,  it creates  another  one with a higher transaction  \nfee. \nThe veriﬁcation  algorithm  consists  of three steps. In the ﬁrst step, a veriﬁer  computes  a hash of the round and veriﬁes  if \nit is inserted  into the blockchain.  In the second  step, the mathematical  correctness  of the signature  and claimed  signature  \ntime are veriﬁed  based on the time when a block, which contains  the hash from the round, was mined.  In the ﬁnal step, \nevery certiﬁcate  from the certiﬁcate  chain, based on the data stored in BAO, is veriﬁed  using revocation  objects.  \n3.2. Scheme  deﬁnition  \nIn the proposed  Round-based  Blockchain  Time-Stamping  scheme  (RBTS scheme)  the following  entities  take part: Long- \nTerm Authority  (LTA), Veriﬁer  - a user who verify a signature,  Signature  Creator  - a user who create a signature  and sends \na signed document  to LTA. \nIn this paper, the following  notation  is used (similar  to [16] ): B - Blockchain;  B i current  i th block of the blockchain  B, SD k \n- k th signed document,  BAO k - Blockchain  Archival  Object for SD k , ADO k - Archival  Document  Object - partially  ﬁlled BAO k , h \n- a cryptographic  hash function,  T s - claimed  time when a document  was signed,  T c - current  time; T x - time when a round \nwas computed,  T i - certiﬁcate  issue time, T e - certiﬁcate  expiration  time, T B i - time when B i was mined,  Cer - a certiﬁcate,  \nCerCh k - a certiﬁcate  chain for SD k , RI k - revocation  information  related  to CerCh k , HT x - a hash tree for round x, RH k - a \nreduced  hash tree for BAO k . \nDeﬁnition  3. The Round-based  Blockchain  Time-Stamping  scheme  consists  of four polynomial  time algorithms:  \n1. Setup () → params;  Run by LTA; On the output of this algorithm  parameters  of the scheme  are ﬁxed, i.e.: supported  \ndigital signature  algorithms,  supported  hash functions,  supported  digital signature  formats,  and the scheme  parameters:  \nbl\nT. Hyla and J. Peja ´s / Computers  and Electrical  Engineering  81 (2020) 106523 5 \nB i to be considered  valid; t int - the maximum  period between  a previous  block and a block with an embedded  hash from \na round. \n2. Create-Archival-Document-Object  . SD k → ADO k , for k = 1 . . . n ; Run by LTA; This algorithm  takes all signed documents  \nas input and outputs  archive  document  objects  for each signed document  SD k . \n3. Update-Round  . ( ADO 1 , ... , ADO n , x ) → ( BAO 1 , . . . , BAO n , H x , B i ) ; Run by LTA. This algorithm  takes archival  document  \nobjects  as input and outputs  these objects  with additional  data necessary  to verify a signature  in long-term  and a hash \nfrom a round x ( H x ) is inserted  into a block B i of a blockchain.  \n4. Long-Term-Verify  . ( BAO k , B i ) → true/false;  Run by Veriﬁer;  This algorithm  takes the blockchain  archival  object and the \nblockchain  as input and returns  true , when the signature  and claimed  signature  time are valid. Otherwise  returns  false . \nThe RBTS scheme  can be conﬁgured  (in Setup algorithm)  to support  a different  digital signature’  algorithms  set. Therefore,  \nalgorithms  like Generate-Key,  Sign , and Verify are not in the scope of the scheme.  However,  algorithm  Verify is internally  used \nby Long-Term-Verify  algorithm.  \n3.3. Security  model \nA document-centric  threat modelling  approach  was used to model security  of RBTS scheme  (similarly  to [17] ). The se- \ncure archiving  process  is a subject  to several  threats.  During  the design process  of the scheme,  the following  threats  were \nidentiﬁed:  \n• accidental  or intentional  unauthorised  modiﬁcation  of a document;  \n• accidental  or intentional  unauthorised  modiﬁcation  of a digital signature  attached  to a document;  \n• unauthorised  submission  of a backdated  document;  \n• submission  of a document  with an invalid digital signature;  \n• loss of validity  of a digital signature  (e.g. disclosure  of a private  key, end of a certiﬁcation  validity  period);  \n• loss of trust in authorities  that issue a certiﬁcate  used to sign a document;  \nThe scheme  should be resistant  to attacks  that implement  above threats.  The RBTS scheme  satisﬁes  the following  security  \nrequirements:  \n• R1: Non-repudiation  of origin - according  to ISO/IEC  13888-1:2009:  service intended  to protect against  an entity’s  false denial \nof having created  the content  of a message  (i.e. being responsible  for the content  of a message)  ; \n• R2: Proof-of-existence  - it is possible  to proof that a document  existed  after certain  date and before another  date (i.e., a \ndocument  existed  between  two points in time); \nThe RBTS scheme  works with the following  security  assumptions:  \n1. Digital signature  scheme  should be proven  secure against  existential  forgery  under an adaptive  chosen  message  attack \n(for deﬁnition  see [18] ). \n2. The digital signature  scheme  is independen"
  },
  {
    "file": "Proposing_a_Blockchain-based_Solution_to_Verify_the_Integrity_of_Hardcopy_Documents.pdf",
    "title": "Proposing a Blockchain-based Solution to Verify the Integrity of Hardcopy Documents",
    "text": "Proposing a  Blockchain-based Solution to Verify the \nIntegrity of Hardcopy Documents \nSthembile Mthethwa, Nelisiwe Dlamini, Dr. Graham Barbour \nCouncil for Scientific and Industrial Research (CSIR) \nModelling and Digital Science Unit, Information Security \nPretoria, South Africa \n{smthethwa, ndlamini2, gbarbour}@csir.co.za \n \nAbstract —Even with the ability to produce documents \ndigitally, the paperless environment has yet to become a reality in \nSouth Africa. Hardcopy documents are still printed daily which \nmakes them susceptible to document fraud. In South Africa, a \ncase was reported recently, where someone who was creating fake documents was exposed. This introduces the challenge when using hardcopy documents which is loss of integrity. Thus, it is \nvital to have systems in place to verify document integrity and be \nable to determine when a document has been tampered with. Various techniques have been used to secure documents, yet the challenge persists. The combination of 2D barcodes, digital \nsignatures, Optical Character Recognition (OCR), cryptographic \nhashing has proved the potential to achieve good results when combined. Recently, blockchain has been added as one of the techniques to be employed for document verification. This paper \npresents a proposed solution that incorporates the combination \nof 2D barcodes, OCR, cryptographic hashing and blockchain. As this is still on-going work, experiments are still required to demonstrate the viability of the solution. \n \nKeywords—blockchain, 2D barcodes, cryptographic hashing, \ndigital signatures, document generation and validation, document verification, integrity, optical ch aracter recognition (OCR), secure \nhash algorithm (SHA-256),  tesseract \nI.  INTRODUCTION  \nNowadays digital documents have become a large part of \nevery sector whether public or private resulting from the transformation of modern technology. This not only allows the dissemination of information but also preserves these documents in digital form and promotes paperless environments. However, a variety of these documents are printed every day such as; academic certificates, wills, case files, birth and marriage certificates, national identity documents, insurance documents, passports and drivers’ licenses, etc. and issued to different people because printed documents are the most prevalent form of trusted communication. A great challenge is therefore experienced along with the advancement in technology; which now make it possible to easily reproduce falsified documents as they are now susceptible to unauthorized alterations [1, 2]. \nA series of forgery cases have been reported in the past. In \nIndia, a woman who was applying for a passport presented a falsified birth certificate, and it took some time for the concerned agency to detect the forgery. The police reported this as a common occurrence when it comes to applicants [5]. Incidents of falsified academic documents have also been reported, for instance, in Singapore\na distributed, replicated and synchronized public ledger has \nmade it possible to implement solutions that validate the integrity of the documents issued. However; more work still remains, the transition from eliminating the use of hardcopy documents to using digital documents hasn’t been successfully navigated as yet considering that hardcopy documents are still widely used. In this paper we use the standard Optical Character Recognition (OCR) technique and incorporate the use of blockchain technology to present an agnostic solution that focuses on the ability to verify the integrity of both digital and hardcopy documents.  \nThis paper is organized as follows, in Section 2, we present \nthe literature review. Then a discussion of the proposed solution is presented in Section 3 and Section 4, concludes the study. \nII. L\nITERATURE REVIEW  \nOver the years, technology has made it very easy to \nproduce digital documents which are easy to retrieve, access and store, and encourages the change to more paperless environments. However; printed documents are still predominant and used to serve the purpose of communicating \nrelevant information to people even though these documents \nhave been perceived as cumbersome and inefficient [8, 9]. With the advancement of technology, the demand to verify important hardcopy documents has escalated, as the issue of fraudulent documents continues to aggravate. Falsifying a hardcopy document requires less effort these days, because these documents are inherently insecure and most have no passwords or digital signatures unlike digital documents.  A long list of techniques have been proposed to mitigate the problem of forged documents mostly digital documents. But research in the area of securing hardcopy documents is starting to gain a lot of traction, since the use of these documents has become undeniable [1].  \nSome of the prevalent techniques include the use of \nwatermarking, which aims to preserve the integrity of a document. Watermarking can either be in a digital or printed format [1].\n This technique is still vulnerable to attacks, which \nmay not necessarily remove the watermark imprinted, but rather disable its readability, the success of watermarks also relies on high quality printers, which incurs cost [8]. Nevertheless, it remains an active research area and continues to be improved [10].  The use of OCR, to recognise text from an image file is also prevalent. OCR is the best tool with regards to character recognition, whereby it takes in an image and returns the recognised text. Tesseract is quiet popular as an open source OCR tool, and is identified as having better accuracy and precision than other OCR tools, e.g. Transym OCR and GOCR [11]. The main issue with using OCR independently, is that it is not sufficiently reliable to determine the accuracy and is not generally 100% especially when a \ndocument has text that is not solidly black and a noisy white \nbackground, nonetheless it can be trained to achieve \nIII. PROPOSED SOLUTION  \n This section describes the proposed solution for verifying a \nhardcopy document and a digital document which is an extension of the solution that was presented initially in [19,  \n20].  In [19] the solution consisted of 4 components, namely; cryptographic hashing, digital signatures, OCR and 2D barcodes. Experiments were conducted using 3 different fonts i.e. Times New Roman, OCRB and AnyOCR and the highest accuracy obtained for AnyOCR was 100% which presented an opportunity to improve the solution so that it can work with different fonts. The documents generated in [20] consisted of 7 barcodes positioned at the bottom of the document, which \npresents a challenge to those who might want to adopt the \nsystem. The number of barcodes is dependent on the information that needs to be stored as each barcode has storage space limitation.  \nThis led to some research on finding ways we can make the \nsolution easily adoptable without the issue of having more barcodes to deal with when documents are generated as this might not necessarily fit in with the company’s objective. All of the components used in the previous solution will still be used for this solution except only one barcode that contains information used to verify will be placed on the document. The solution is designed in a way that, if an attacker tries to tamper with the document, the system can detect those changes. In this paper we won’t discuss the other components used for this solution as this was done in [20]. Only the added component and the modifications introduced are discussed.   \nA. Components of the proposed solution \n1) Barcodes:  This component was used in our previous \nsolution, however; the limitations of storage space led to the use of more barcodes in order to accommodate all the information required to validate a document. The maximum capacity of a version 40 barcode in byte mode is between 1273 – 2953 bytes. In [20]  , we observed that this barcode capacity \npresented flaws as it possessed high resolution which yielded negative results after printing and scanning the document. The quality of the data stored in the barcode was poor. To improve this the metadata was divided into 7 portions and stored in 7 smaller barcodes making sure that the capacity used in the barcodes is distributed equally and doesn’t reach a growing rate that presents poor quality when the barcodes are decoded and read.  The possibility of the capacity growing in the barcode therefore presents a downfall. This challenge might prevent the adoption of this system as a company would not agree to change their structur e in-order to accommodate for \nmore barcodes. For the reason that existing companies already have an acceptable format and layout they use to create documents. We realised when we demonstrated the first developed prototype a lot of questions were centred on the multiple barcodes, and some companies were concerned about the space used by the barcodes and the aesthetic\nThe digital signature and metadata are stored on the \nblockchain and a unique key is generated. This unique key and public key associated with the secret key used to create a \ndigital signature are encoded to the barcode which is placed on \na document. The metadata consists of; position, length, width and checksum values that are derived for each validation text, hash produced for all the validation text labels and timestamp of when the document was created. Finally, a digital copy is sent to the recipient and the pdf document is generated, printed \nand presented.  \n \nFig. 2. Encode Information. \n \n2) The Validation Process: Once the documents have been \ngenerated, printed and issued, the recipient can then use the documents in various cases, i.e. applying for jobs, applying for bank acounts etc. When these documents are submitted, they must be verified in order to determine whether their integrity has been maintained. Users can either submit a digital copy or a hardcopy document. If a hardcopy document is presented, the document must be scanned first in order to obtain a digital copy. To start the process of validation, the system reads in a scanned image and the barcode is identified and decoded. The barcode consists of a public key and unique key (which is used to fetch metadata related to the document from the blockchain). With the use of the public key extracted from the barcode, the digital signature is validated, if valid the metadata is extracted and used to locate the validated labels in the document. Thereafter, Tesseract OCR is used to validate the text labels. The hash (of all the validated text labels) is calculated and compared with the one from the original document (retrieved from the blockchain). If the comparison fails, it means the document has been altered. In addition to the hash that is included, a checksum for each text label is also calculated, this aids to point the exact text label that is not matching. Fig. 3, illustrates the process of document validation.  \n \n \n \n \nFig. 3. Validation Process \n \nThe evaluation of the proposed solution will use a dataset \ngenerated using the generation process. The dataset would consist of 100 generated documents, using different fonts, i.e. Courier, Arial, Times New Roman etc., in order to determine the accuracy of OCR on these documents. The dataset will also be separated into different groups, on the size of text, which are; small, medium and large text. The validation process will be used to verify the integrity of the documents. To evaluate this, the information retrieved from the blockchain must be the same as the one presented when hashed.  \nBased on the studies conducted, the use of blockchain to \nverify documents is not something new and the implementations discussed in this paper have been a great success. Be that as it may most proposed and implemented solutions focus more on utilizing a single hash for verification purposes, whereby the document content is hashed and the cal\nThis is made possible by including the exact position of the text \nthat should be validated, (x and y coordinates) and the width of the text in the metadata. Before using OCR when the text is extracted from the document all white spaces are removed to minimize any additional white spaces introduced in the process. In most case a single hash value is used to represent the document’s content, which cannot be obtained as a hash is designed to be a one way function, whereby we don’t know the contents of the document, nor are we aware of the location of the altered text.   \nIV. C\nONCLUSION  \nThis paper presented a proposed solution for the problem of \ndocument forgery, which is an extension to our previous proposed solution. The solution employed 4 techniques; OCR, cryptographic hashing, digital signatures and 2D barcodes. OCR was the first technique to be implemented, whereby documents were generated using a font known as AnyOCR (which is designed for OCR tools) and Tesseract was used to validate the documents. The experimental results yielded an accuracy of 100%, which is good. The second part of the experiment was to combine all the techniques, whereby new \ndocuments were generated and validation text was specified \nwhich was then added to the barcodes that are positioned at the bottom of the documents. Using our validation process, the system was able to detect when documents have been tampered with. This paper extends the previous solution by limiting the number of barcodes used to a single barcode and using blockchain to store the information that was previously stored in barcodes. This proposed solution will be implemented and tested for its practicability to detect forgery and ensure that the integrity and authenticity of a hardcopy document is maintained. \nA\nCKNOWLEDGMENT  \nThe authors would like to express their gratitude to the \nCSIR Modelling and Digital Science Unit for sponsoring this research. \nR\nEFERENCES  \n[1] A. Husain, M. Bakhtiari, and A. Zainal, “Printed Document Integrity \nVerification Using Barcode,” Journal Teknologi (Sciences and Eng , \npp.99-106, 2014. \n[2] M.H. Eldefrawy, K. Alghathbar, and M.K. Khan, “Hardcopy document \nauthentication based on public key encryption and 2D barcodes,” In Biometrics and Security Technologies (ISBAST), 2012 International \nSymposium, pp. 77-81, IEEE, March  2012. \n[3] R. Jain, and D. Doermann, “Visualdiff: Document image verification \nand change detection,” In Document Analysis and Recognition (ICDAR), \n2013 12th International Conference on  pp. 40-44, IEEE, August 2013. [4] N. Ganesan, “ Three foreigners jailed in Singapore for submitting fake \nacademic certificates _ Human Resources Online , Human Resources ,” \nAvailable at: http://www.humanresourcesonline.net/three-foreigners-jailed-for-submitting-fake-academic-certificates/ (Accessed: 07 February \n2018), 2017. \n[5] S. Kalipa, “ Home Affairs official sold us fake papers _ IOL News , Crime \nand Courts IOL News ,” Available at: https://www.iol."
  },
  {
    "file": "Redactable Signature Schemes and Zero-knowledge Proofs.pdf",
    "title": "",
    "text": "Redactable Signature Schemes and Zero-knowledge Proofs: A\ncomparative examination for applications in Decentralized\nDigital Identity Systems\nBryan Kumara, Mark Hooper, Carsten Maple, Timothy Hobson, and Jon Crowcroft\nThe Alan Turing Institute, London, U.K. Email: bkumara, mhooper, cmaple, thobson, jcrowcroft @turing.ac.uk\n23 July 2023\nAbstract\nRedactable Signature Schemes and Zero-Knowledge Proofs are two radically different approaches to enable privacy.\nThis paper analyses their merits and drawbacks when applied to decentralized identity system. Redactable Signatures,\nthough competitively quick and compact, are not as expressive as zero-knowledge proofs and do not provide the same level\nof privacy. On the other hand, zero-knowledge proofs can be much faster but some protocols require a trusted set-up.\nWe conclude that given the benefits and drawbacks, redactable signatures are more appropriate at an earlier stage and\nzero-knowledge proofs are more appropriate at a later stage for decentralized identity systems.\n1 Introduction\nA critical aspect of economic growth is the integration of the\ninternet as a medium for innovation and exchange [16]. It is\nvital that digital identities which computationally represent\nexternal agents are able to address stakeholder concerns as\neach digital identity system comes with its own set of trade-\noffs that considers various factors such as security, reliability,\nresilience, accessibility, and scalability [17] [16] [5] [2]. A key\nissue these systems may consider is the degree to which a sin-\ngle party may exert control over the operation of the system.\nCentralized digital identity systems usually contain a dedi-\ncated registration process and store information in a central\ndatabase [13]. However, the centralization of authority and\nstorage carries the risk of abuse such as exclusion and censor-\nship alongside individual profiling [20].\nOne approach to address these concerns is to adopt a de-\ncentralized identity system. This approach typically involves\nthe use of transparent, open networks and protocols with vol-\nuntary participation in the attempt to minimize data collec-\ntion or formal enrolment [23]. To achieve this, Decentralized\nIdentifiers (DIDs) and Verifiable Credentials (VC) are typi-\ncally used. The former is a globally unique identifier which\nallows a party to be identified in a verifiable and persistent\nmanner without the need of a centralized registry. The latter\nis an open standard for digital credentials with a digital sig-\nnature. A VC can be issued by anyone and can be presented\nfor verification by everyone. A combination of DIDs and VCs\ngives individual parties control of their digital attributes with-\nout a central authority [4].\nDIDs and VCs rely on some verification mechanism to es-\ntablish truth. This can be done through cryptographic proto-\ncols such as a digital signature which ensures a message was\ncreated by a known sender without tampering [15]. There\nare interesting protocols one can con\ncan actually be harmonized by being implemented at different\nstages of an decentralized identity system to provide a high\nlevel of user privacy to best ameliorate their shortcomings.\n2 Background\n2.1 Redactable Signature Schemes\nPublic-key cryptography, which encompasses digital signa-\ntures and zero-knowledge proofs, rely on the hardness of solv-\ning some mathematical problems. This paper focuses pairing-\nbased cryptographic techniques, which consists of three bilin-\near groups G1,G2,GTand a bilinear map e:G1×G2→GT.\nThese groups and mappings satisfies the following properties\nfor some prime order p:\n•for all g∈G1,˜g∈G2anda, b∈Zp,e(ga,˜gb) =\ne(g,˜g)a˙b;\n•forg̸= 1G1and ˜g̸= 1G2,e(g,˜g)̸= 1GT;\n•the map eis efficiently computable.\nThere are three different types of pairings - Type 1 pair-\ning where G1=G2, Type 2 pairing where G1̸=G2with\nan efficiently computable homomorphism ϕ′:G2→G1, and\nType 3 pairing where G1̸=G2with no efficiently computable\nhomomorphishms ϕ:G1→G2andϕ′:G2→G1. We only\nconsider Type 3 pairing in this paper [6].\nThe RSS construction we examine relies on following com-\nputational assumptions for its security [6]:\n•Symmetric Discrete Logarithm (SDL) Assumption:\nGiven ( g, ga)∈G2\n1and (˜ g,˜ga)∈G2\n2, it is hard to recover\na.\n•Extended Decisional Diffie-Hellman (EDDH) Assump-\ntion: Given ( {ga·ci}2n2\ni=0,{gb·ci}n−1\ni=0,{gci}3n2\ni=1,{gd·ci}2n2\ni=1∈\nG7n2+n+2\n1 and ({˜gci}2n2\ni=1,˜gd,{˜ga·c1}i∈[1,2n2]\\[n2−n,n2+n],\nit is hard to decide if z=a·b·cn2+b·dorzis random.\nWith these foundations, we can construct the Pointcheval-\nSanders (PS) digital signature. This signature is re-\nrandomizable, meaning that given a valid signature one can\nderive a new version of that signature on the same message\nby introducing a random element [26]. It will be a useful\nproperty as we construct RSS from PS. To sign a message\nm= (m1, ...m r)∈Zr\np, the PS scheme does the following [6]:\n•Setup (1k): Given a security parameter k, output pp←\n(p,G1,G2,GT, e) of type 3 bilinear groups.\n•Keygen (pp): given the public parameters, ˜ g$←G2\nand ( x, y1, ..., y r)$←Zr+1\np, compute ( ˜X,˜Y1, ...,˜Yr)←\n(˜gx,˜gy1, ...,˜gyr). Let the secret key sk= (x, y1, ..., y r)\nand the public key pk= (˜g,˜X,˜Y1, ...,˜Yr).\n•Sign(sk, m 1, ..., m n): Generate a random h$←G2and\noutputs the signature σ←(h, h(x+Σyj·mj))\n•V erify (pk,(m1, ...m r), σ): Given a signature σ=\n(σ1, σ2), check if σ1̸= 1G1ande(σ1,˜X·Π˜Ymj\nj) =\ne(σ2,˜g) are satisfied. If it is, return 1 else return 0For proofs of correctness and security alongside a more com-\nprehensive overview of the PS signature scheme, readers\nshould refer to [6]. Given the PS signature scheme, one only\nneeds slight modification to reach the RSS construction. The\nidea of this RSS is that given a set of messages {mi}i∈Iand an\nassociated signature σ, one can redact parts of a message i∈I\nfor some I⊂[1, n] and I= [1, n]\\Isuch that the signature\nis valid for {mi}i∈I. For a more comprehensive treatment of\nRSS that covers alternative constructions and featu\n•V erify (pk, σ,{mi}i∈I): Given a signature σ, a public\nkeypk, and a message {mi}i∈I, ifσ1= 1G1, return 0.\nOtherwise, test if both equations hold before returning\n1:\n–e(σ1,˜X·˜σ·Πi∈I˜Yimi) =e(σ2,˜g);\n–e(σ3,˜g) =e(Πi∈IYci\nn+1−1,˜σ);\nNote that the public key of the issuer is sufficient to gen-\nerate a derived signature, which allows a holder of a creden-\ntial redact and derive signatures without informing the issuer\nwhich is just the feature we’d like users to have in a decen-\ntralized ecosystem.\n2.2 Zero-Knowlege Proofs\nZero-knowledge proofs (ZKPs) are methods where a party\ncalled the prover can prove to another party called the ver-\nifier that a given statement is true without revealing any ad-\nditional information [22]. Traditionally, a prover can show\nknowledge of a certain piece of information by simply reveal-\ning it. However, ZKPs allows one to prove possession of certain\nsecret knowledge called a witness which satisfies some state-\nment without revealing the witness itself or any additional\ninformation [22]. ZKPs have a diverse range of constructions:\nsome require an initial set-up phase, represent computations\ndifferently, and some protocols may involve multiple rounds of\ninteraction between the prover and the verifier [22].\nFor the purposes of this paper, we consider a type of ZKP\ncalled Zero-Knowledge Succinct Non-Interactive Argument of\nKnowledge (ZK-SNARK) which are efficient in terms of size\nand verification time (Succinct), does not require multiple\nrounds of communication between the prover and the veri-\nfier (Non-interactive), and provides sound proofs against a\npolynomial-bounded prover (Arguments of Knowledge) [24].\nTheoretically, a protocol is defined as zero-knowledge with re-\ngards to a simulator. This is a machine that operates in a\ntheoretical world that is indistinguishable from the real world\nfor a party that attempts to decide if knowledge was leaked.\nIn this theoretical world, the the simulator can compute a\nproof without anything else but by just knowing the truth of\nthe statement. A protocol is then zero-knowledge if a proof\nproduced by a simulator who does not know the witness is the\nsame as one produced by a real-world prover that knows the\nwitness [24].\nThe efficiency of ZK-SNARKs in terms of size, speed, and\ncommunication makes this an attractive protocol for anony-\nmous disclosure. However, ZK-SNARKs require an initial\nset-up phase that requires trust. This procedure generates\na common set of parameters called the common reference\nstring (CRS) that must be used every time we run a ZK-\nSNARK proof. CRS generation requires trust as parties in-\nvolved must delete by-products of the procedure called toxic\nwaste which may otherwise be used to generate forged proofs\n[24]. Formally, a ZK-SNARK uses some efficiently decidable\nbinary relation Rwith pairs ( u, w)∈ R where uis called\nthe statement and wis the witness. A non-interactive ar-\ngument for Rconsists of probabilistic polynomial algorithms\nΠ = ( G, P, V er, Sim ) wh\nmeeting some predetermined requirement. Once the creden-\ntial is placed on the list of issued credential, the user can use\nit to prove that some access criteria is met to other parties.\nUsing a credential provides a membership proof of the creden-\ntial being on the list of issued credentials, and a proof that\ncommitted attributes of credentials meets the access criteria.\nA credential can be revoked simply by removing it from the\nlist of issued credentials. In [19] notes that there are multiple\nways to demonstrate set membership, and uses Merkle forests\nas a new approach to gain a large reduction in proof genera-\ntion time but a slight increase in verification time and witness\nsize. An examination of alternative approaches can be found\nin [12].\nGroth16 linkage proofs can be combined with membership\nproof (which shows that an element belongs to a set) and mul-\ntiple access proofs (which shows that some criteria is fulfilled\nby a prover) to create Blind Groth16 [19]. Blind Groth16 al-\nlows us to reuse membership proofs in multiple showings and\nstill maintain privacy [19]. This also allows an easy compo-\nsition of access criteria to prevent determining in advance all\nthe circuits that verifiers will support, prevent the generation\nof circuit parameters for every combination of access criteria,\nand avoid dynamical generation of circuit parameters for ac-\ncess criteria as they are needed. Consequently, Blind Groth16s\nallows one to show that various Groth16 proofs are made based\non the same credential without revealing the credential. A full\nexploration of zk-Creds can be found in [19].\n3 Concrete Performance Metrics\nPrevious work on RSS have generally examined its perfor-\nmance with respect to the number of arithmetic operations re-\nquired, or from a theoretical computational complexity. How-\never, to better assess their suitability for VCs, we would need\nconcrete metrics such as run-time and size in terms of millisec-\nond and bytes respectively. Thus, we have gathered results on\nboth RSS and zk-Creds for VCs when implemented using the\nRust programming language.\nThe VC we considered is compliant with W3C standards\nwhich can be found in [7]. This sample VC details a user’s\npersonal information such as their name, date of birth, and ad-\ndress (which consists of street name, postcode, and country).\nFor RSS, we want to create a redacted VC which shows that\na user resides in a certain country and nothing else. Thus, all\nthe fields but the name the country have been redacted which\nshould give us a good illustration of near-worst-case perfor-\nmance as users redact leave only two fields unredacted. The\ncode for our implementation can be found on [25]. As this is\nmerely a proof-of-concept, the implementation would be un-\nsuited for immediate deployment in a VC system, and only\nunit testing has been conducted to ensure that components\nrun as intended.\nWe collect the speed and size of the RSS algorithm dis-\ncussed in the previous section. We have 4 algorithms to \nflexible attribute redaction for selective disclosure, no require-\nments for a trusted set-up, and possible schemes built on top\nof it. However, it has some key drawbacks. From the re-\nsults gathered, the constant signature and private key size of\n1344 bytes and 112 bytes respectively are substantially big-\nger than other signature schemes used in VCs. For instance,\nthe pairing-based BBS+ signature scheme that is in the final\nstages of standardization has a signature size of 112 bytes and\na private key size of 32 bytes alongside a 96 byte public key\nwhen instantiated on the widely used BLS12-381 parameters\n[28] [3]. This is a far more attractive in terms of size, and\nBBS+ signatures provide proof-of-knowledge schemes that\nalso enables selective disclosure of messages similar to ZK-\nSNARKs. Given our implementation scenario that considered\nredacting all but one’s name and country on a VC, the BBS+\nproof would have a size of 464 bytes. Again, in terms of size,\nthis is a significantly more attractive result than RSS by of-\nfering half the size of a derived signature.\nRegarding the run-time, most of the RSS algorithms are\nmuch slower than BBS+. For instance, generating keys takes\n151.81ms for BBS+ but 588.22ms for RSS public keys. RSS\nkey generation has the potential to run much slower too, given\nthat public keys scale linearly with the size of a message. In\naddition, signing using the BBS+ scheme takes only 57.02ms\nwhich is almost 10x faster than the RSS signature and almost\n15x faster than generating a derived signature. The only su-\nperior performance for RSS is in the verification, where RSS\ntakes 310.77ms to verify whilst verifying a BBS+ proof takes\n3478.74ms. This is a roughly 10x difference, but in absolute\nterms the slowness of BBS+ proof verification will be much\nmore noticeable to users than the comparative difference in\nBBS+ and RSS signing. The issue of the BBS+ proof ver-\nification is also more significant when we consider that the\nBBS+ proof verification has a linear scaling. Considering a\nVC with significantly more attributes than our implementa-\ntion, going beyond 3.5 seconds to verify may become a barrier\nfor adoption.\nThough the public key of RSS will scale with the length\nof the message, it is arguable that given the rare frequency of\ngenerating keys this is an acceptable one-off cost unlike the\nlinear growth of a BBS+ proof which has to be used every\nsingle time one wants to perform selective disclosure. Thus, if\nspeed is a concern the verification time of RSS may make it\npreferable than adopting BBS+ signatures.\nHowever, there are other considerations outside of the con-\ncrete metrics from RSS. On a general level, RSS offers cre-\ndential holders a level of flexibility with what information to\ndisclose. Returning to the canonical example of showing that\none is above 18 years old, an individual may not want to show\nany other fields of a VC except for their age. However, other\nusers may have less concerns and be comfortable with di"
  },
  {
    "file": "Secure_Document_Verification_System_Using_Blockchain.pdf",
    "title": "Secure Document Verification System Using Blockchain",
    "text": "978-1-6654-3493-5/21/$31.00 ©2021 IEEE  SECURE DOCUMENT VERIFICATION \nSYSTEM USING BLOCKCHAIN  \n \nOiza Salau  \nComputer Engineering Department  \nNile University of Nigeria  \nAbuja, Nigeria  \noiza.salau@nileuniversity.edu.ng  Steve A. Adeshina  \nComputer Engineering Department  \nNile University of Nigeria  \nAbuja, Nigeria  \nsteve.adeshina@nileuniversity.edu.ng  \nAbstract—Document verification is a complex domain that \ninvolves processes to authenticate original documents. Some \noriginal documents like birth certificate, university diploma, \ncontract, certific ate of occupancy, Will etc. may  involve serious \nverification and authentication practices, because fake \ndocuments can easily be created. A skillfully generated fake \ndocument is always difficult to detect and can be treated as \noriginal. With the increase of forged  documents, the integrity of \nboth the document holder and the issuing author ity is \njeopardized. This research  is intended to address the issue of \nelectronic document forgery and provide an alternative secure \nmeans for storing documents . The aim of this res earch is to \ndesign and implement a secure document verification system \nusing blockchain. The result of this stud y shows how the user \ndocuments are  stored securely in the blockchain, and if any \nchange or adjustment are made to the documents the chain \nbecome s invalid and the user will be notified  \nKeywords — blockchain, decentralization, hashing, \ninterplanetary file system, digital certificate  \nI. INTRODUCTION  \nIn today’s world,  digital documents are now becoming a \nlarge part of every section whether private or public resulting \nfrom the change in  modern technology. This does not only \nallow the spreading of information but also saves the \ndocuments in digital form and helps promotes a paperless \nenvironment [1]. Digital documents are easy  and convenient \nto use but, proving their authenticity is often difficult. Since \nthere is no common protocol to verify and validate digitized \ndocuments, the process of analyzing the documents in \ngovernment and private institutions is difficult [1].  \nIn a country like Nigeria, the document verification \nprocess is still based on printed documents. Original \ndocuments such as, insurance documents, wills, academic \ncertificate, contracts, birth certificate, marriage certificate, \ncase files etc. these documents might be subjected to a process \nof verification by an authority using signature, and this \nprocess is known to be time consuming and cumbersome. \nLater if there is a need for another verified copy of the same \ndocuments, the whole pr ocess will be repeated or a copy of \nthe document will be verified by a third party. In addition, \nthere could be loss of some documents due to \nmismanagement, a greater challenge is experienced wi th the \nadvancement in technologies, which makes it possible to  \nreproduce falsified  and fake document, as they are now \navailable to unauthorized alterations.  \nA number  of forgery ca\ni. Digital signature wit h Public Key Infrastructure PKI  \nii. Blockchain Technology  \nA. Digital Signature with Public Key Infrastructure  \nPublic Key Infrastructure (PKI) is a technology for \nauthenticating devices and users in a digital world. The idea \nis to have one or more trusted partie s to digitally sign a \ndocument certifying that a particular cryptographic key \nbelongs to particular device or user. The key can be used as \nan identity for the user in digital networks [5]. Trusted Third \nParties (TTP), are known as a secured middle layer on cloud \nservice transactions they allow secure, trustful, interaction \nbetween two parties. Certificate Authority (CA), are a type of \ntrusted third parties (TTP) that delivers validation authority \nfor a PKI [6]. A certificate authority is a company that acts to \nvalidate the entities such as email addresses, websites, \ncompanies or individual users and bind them to cryptographic \nkey through the issuance of digital certificates. A digital \ncertificate provi des [5]; \nauthenticity , by serving as a credential to validate the identity \nof the entity is issued to.  \nEncryption , for secure communication over insecure \nnetworks like the internet.  \nIntegrity,  of documents signed with the certificate so they \ncannot be alt ered by a third party in transit  \n \nB.  Blockchain Technology  \nBlockchain technology has been in existence since  the \nyear 2009, since it has been existing for eleven years, it has \nsucceeded  in resisting attempts to take it down , hack into it \nor corrupt it [7]. Researchers are always searching for places \nwhere blockchain technology can be implemented . \nBlockchain can be defined as a publicly accessible ledger in \na distributed network that records digital transactions.  The \nmain strength of blockchain is the ability to provide a single \nsource of truth through its characteristics which are \nimmutability, decentralization, security and transparency  [8]. \nThe blockch ain is a type of distributed  public key \ninfrastructure , there are some dif ferences bet ween the \napplication and purpose of digital signature  in a centralized \nconventional public key infrastructure and the application and \npurpose of digital signatures in the blockchain.  In the \nblockchain, th e hash value authenticates both block data and \ntransaction data. While in  public key infrastructure,  the \nauthentication of the digital certificate  is done using the hash \nvalue. In addition , the application that generates the \nblockchain hash value can be stored privately and separately. \n[9] \nThe blockchain adaption is more advantageous to \ndocuments with a permanent retention schedule. This is \nbecause the hash value, which is a main feature of the \nblockchain, stands as validation metadata that would not \nrequire specific software for future verific ation. In addition, \nthe blockchain records does not require a centralized network \nsuch as the certificate authority to notarize or verify the \nhashes.  \nC. Inte\nThe author in [16 ] designed a system for digital document \nverification using blockchain. The system was designed to \nreview the certificate and personal ID from the un iversity and \nID card verification site. If the students ID cards and \ncertificate are original, it saves the serial number of the \ncertificate and the ID on the blockchain. Then the system \ngenerates a QR code that is kept on the e -certificate along \nwith a serial number will be sent to the user. A company can \nnow verify the certificate using the serial number on the \nblockchain or by scanning the QR code.  \nThe author in  [17] designed a certificate verification \nsystem using blockchain. The aim of their research  was to \neliminate educational certificate fraud with the use of \nblockchain technology. Their proposed system worked by \nregistering a university in the blockchain using wallet. Once \nthe university is added, the university will create the \ncertificate using d ata fields and store the hash on the \nblockchain, the resulting transaction ID will be sent to the \nstudent. With the use of that ID, anyone would be able to \nverify the document on the system blockchain.  \nThe reviewed literatures revealed that several studie s, \nresearch, practical works have been done to enhance \ndocument verification system. With the above review some \nliterature gap was revealed, most of the reviewed literature \ndesign made use of QR codes and digital signature for \nverifying the documents. The few researchers that used \nblockchain technology for document verification did not \nincorporate IPFS for storing the document before hashing and \nstoring the immutable permanent link in the blockchain. With \nthe use of IPFS the large document would be stored w ithout \nhaving to worry about space.  \nIn this project the use of blockchain technology along with \ninterplanetary file system (IPFS) will be incorporated to \npresent a solution that focuses on the ability to verify the \nauthenticity, integrity, nonrepudiation o f an electronic \ndocument and also store and share the content of an electronic \ndocument in a secure system.  \n \nIII. PROPOSED  DESIGN  FOR THE DOCUMENT  \nVERIFICATION  SYSTEM  \nIn this research, a secure document verification system \nusing blockchain was developed  based on relevant \ntechnology. The system is a web based application that was \nprogrammed using java. The system uses a self -developed \nblockchain written in java language.  \nTo create a secure document verification using \nblockchain. All organizations / users will have an address \nfrom which it can send transactions. Users can only be added \nby the system admin, once added the user can have access to \nthe system. Each uploaded documents will be stored in the \ninterplanetary file system (IPFS) which will return a un ique \nhash of the documents. The hash serves as a unique identity \nfor each documents and will be encrypted along other \ninformation like name and date created using SHA -256 \nencryption algorithm. The result\n   \nDOCUMENT VERIFICATION SYSTEM\nWEB APP USER/COMPANYVERIFYING THE DOCUMENT PHASESTORING THE DOCUMENT PHASECREATES ACCOUNT VERIFIES  ACCOUNT\nIF SUCCESSFULACTIVATES \nACCOUNT\nSENDS DOUCMENT \nFOR STORINGNO\nYES\nSTORES  THE \nDOCUMENT IN IPFS\nIPFS RETURNS A \nUNIQUE HASH OF \nTHE DOC\nTHE HASH ALONG \nWITH SOME INFO IS \nSTORED IN \nBLOCKCHAINSENDS A UNIQUE ID \nFOR THE DOCU.\nUSES THE ID FOR \nVERIFICATIONIF \nSUCCESSFULLY \nVERIFIED\nDISPLAY THE \nDOCUMENTYES\nDOCUMENT NOT \nVALIDNO  \nFig 2. Flow chart diagram of the system  \n \nFigure 2 shows the flow chart diagram of the system. It shows \nsystematically  how each processes are executed. Starting \nfrom the creation  of account, which  is done at the user end to \nthe verification of the document, which is done at the back \nend of the system.  \n \n \n  A. Pseudocode   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Algorithm for Document Verification Using \nBlockchain  \nMethods:  \nRegister User  \nLogin \nSave Document  \nGet Documents  \nDownload Document  \nValidate Chain  \n \nRegisterUser  Method: \n    Get User Details  \n    Set User Authority  \n    user_exist = Check Username does not exist  \n    if user_exist:  \n        return error of username exist  \n    else: \n        Encode user password  \n        Save User on portal_user table  \n \nLogin Method:  \n    Check portal_user table for Username  \n    login_success = Check password matches encoded \npassword for user && user is active  \n    if(login_success):  \n        update user last login  \n        generate token for user  \n        return user token  \n    else: \n        return error of invalid login  \n \nHashDocumentInfo Method:  \n    convert document object to json string  \n    hash string with SHA -256 algorithm  \n    return newly generated hash string  \n     \nSaveDocument Method:  \n    Validate Token and Get User Detail  \n    set upload ed by and upload date  \n    store file on ipfs and get ipfs hash  \n    last_doc = order by id descending get first item on \nordered list for table document_info  \n    set last_document hash on new document  \n    set document hash with HashDocumentInfo()  \n    store document info on document_info table  \n \nGetDocuments Method:  \n    Validate Token and Get user Detail  \n    search document_info for document with user  \n    return list of document  \n \nGetChain Method:  \n    Select Document Hash column from document_info \nordered by id asc \n    return list of hashes  \n \n \n \n \n \nAuthorized licensed use limited to: BML Munjal University. Downloaded on November 24,2025 at 20:28:23 UTC from IEEE Xplore.  Restrictions apply. \n \n \n \n \n \n \n \n \n \n \n \n \n \nIV.  RESULT  AND DISCUSSION  \nIn this section, the implementation of the system is \ndiscussed and the technical information about the system is \npresented. IntelliJ is the IDE that was used in writing the \nsoftware in java. Springboot application was used as the \nframework for developing t his web application. The \napplication has an IPFS for storage, a database for storage, a \nservice layer which is written in java. A frontend written in \nHTML, CSS, and JavaScript.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 3. Starting the IPFS  \n \nFigure 3 above, shows how the  IPFS starts it  scans through \nall necessary dependencies before the application starts.  \n  \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nF \nFig 4 . Saving a file on the system  \n \nThe image above shows how a user saves a document on the \nsystem. The user fills in the required space and uploads his \ndocument.  when the user clicks on the upload button the \ndocument will be saved and the document ID which is the \nhash will be sent to the user  as shown in figure 5 .  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 5 . List of stored document on the system  \n \nFigure 5 shows the list of stored document on the system. If a \nuser wishes to share a file. The user clicks on the “share” \nbutton and the hash value for that file is displayed as shown \nabove. It is the hash value that the  user shares. With the hash \nthe document can be displayed and verified from anywhere in \nthe world.  \n \n \n \n \n \n \n \n \n \n \n ShowChainValidation Method:  \n    select document info from document_info ordered by \nid ascending  \n    Create response as string array size of documents list \nand pre fill with 'not valid'  \n    for i = 1 to array length:  \n        current_info = info on position i  \n        previous_info = info on position i -1 \n        if current_info hash not equal \nHashDocume ntInfo(current_info):  \n            return response  \n        if current_info previous_hash not equal \nHashDocumentInfo(previous_info):  \n            return response  \n        set response(i) to 'is valid'  \n    return response  \n \n \n \n \nAuthorized licensed use limited to: BML Munjal University. Downloaded on November 24,2025 at 20:28:23 UTC from IEEE Xplore.  Restrictions apply. "
  },
  {
    "file": "[base]a zero knowledge proof enabled blockchain based record verification system.pdf",
    "title": "A  Zero-Knowledge Proof-Enabled Blockchain-Based Academic Record Verification System",
    "text": "Academic Editor: Hyoungshick Kim\nReceived: 15 April 2025\nRevised: 8 May 2025\nAccepted: 23 May 2025\nPublished: 30 May 2025\nCitation: Berrios Moya, J.A.; Ayoade,\nJ.; Uddin, M.A. A Zero-Knowledge\nProof-Enabled Blockchain-Based\nAcademic Record Verification System.\nSensors 2025 ,25, 3450. https://\ndoi.org/10.3390/s25113450\nCopyright: © 2025 by the authors.\nLicensee MDPI, Basel, Switzerland.\nThis article is an open access article\ndistributed under the terms and\nconditions of the Creative Commons\nAttribution (CC BY) license\n(https://creativecommons.org/\nlicenses/by/4.0/).\nArticle\nA Zero-Knowledge Proof-Enabled Blockchain-Based Academic\nRecord Verification System\nJuan Alamrio Berrios Moya1\n, John Ayoade2,*\nand Md Ashraf Uddin2\n1School of Engineering, Auckland University of Technology, 55 Wellesley Street East, Auckland Central,\nAuckland 1010, New Zealand; wtm7791@autuni.ac.nz\n2School of Information Technology, Crown Institute of Higher Education, 116 Pacific Highway,\nNorth Sydney, NSW 2060, Australia; ashraf.uddin@cihe.edu.au\n*Correspondence: john.ayoade@cihe.edu.au\nAbstract: Academic credential fraud presents a significant challenge to the global academic\nand labor markets, undermining the credibility of legitimate qualifications. In this paper, we\nintroduce ZKBAR-V , a Zero-Knowledge Proof-Enabled Blockchain-Based Academic Record\nVerification System. This system is designed to provide a privacy-preserving, immutable,\nand secure framework for managing academic credentials. The proposed system leverages\nzkEVM smart contracts on a blockchain-based infrastructure that enables credential\nverification without exposing underlying data. The approach integrates Decentralized\nIdentifiers (DIDs) to standardize identity management while eliminating reliance on\ncentralized authorities. We have used dual-blockchain, which separates public and\nprivate information, which can enhance both efficiency and privacy. In addition, this\napproach employs the Interplanetary File System (IPFS) for decentralized and secure\ndocument storage. ZKBAR-V is designed as an open-source, interoperable solution with\na standardized Application Programming Interface (API) for seamless integration. We\nimplemented the system and conducted comprehensive testing, which demonstrates its\ncapability to manage transactions securely, maintain privacy, and reduce costs compared\nto traditional Ethereum mainnet-based solutions. By combining advanced blockchain\ntechnologies, decentralized storage, and globally unique identifiers, ZKBAR-V offers a\nscalable, adaptable, and robust solution for academic credential management. This strategy\ncan significantly enhance credential integrity, promote global student mobility, and provide\ninstitutions worldwide with a trustworthy and efficient verification system.\nKeywords: academic credential fraud; blockchain; interplanetary file systems; security\nand privacy\n1. Introduction\nAcademic credential fraud has become a widespread global issue, contributing to\na multi-bi\nSensors 2025 ,25, 3450 2 of 24\n• Data privacy—Maintaining compliance with regulations like GDPR and FERPA while\nsecuring student information.\n• Global interoperability—Creating a standardized system that allows credentials to be\nverified seamlessly across institutions, employers, and borders.\nThe increasing prevalence of fake academic credentials has become a critical\nchallenge in the education sector, raising concerns about the integrity of academic\nqualifications. Traditional verification methods—such as physical certificates, emailed\ntranscripts, and direct institutional communication—are often manual, time-consuming,\nand susceptible to forgery or manipulation, making it difficult for institutions and\nemployers to authenticate credentials reliably [ 1]. As a result, there is a growing\ninterest in blockchain technology as a solution to enhance the security, transparency,\nand interoperability of academic records. Blockchain-based credentialing systems provide\ntamper-proof, decentralized verification mechanisms, ensuring the authenticity and\ncredibility of academic qualifications across institutions and geographical boundaries [4].\nTo address these challenges, various blockchain-based models have been proposed\nand developed, including Blockcerts [ 5], Hyperledger-based systems, and Ethereum-based\ncredential verification frameworks. However, despite the potential benefits, there are\nstill significant hurdles, such as scalability, privacy concerns, and regulatory compliance\n(e.g., GDPR). While some systems, such as B-ACVS and Blockcerts, have been successfully\nimplemented, many remain at the theoretical stage with no fully functional prototypes.\nMoreover, existing solutions often lack interoperability, making it difficult to establish a\nglobal standard for academic credential verification. Research suggests that blockchain-based\ncredential verification can enhance transparency , security , and efficiency in academic record\nmanagement [6–8]. However, several challenges hinder widespread adoption:\n• Scalability issues due to high gas fees and transaction costs on public blockchains.\n• Lack of privacy mechanisms in existing blockchain solutions, exposing sensitive\nacademic data.\n• Interoperability barriers caused by differences in institutional infrastructure and digital\nidentity management.\nTo overcome these limitations, we propose a ZKBAR-V (Zero-Knowledge Proof-Enabled\nBlockchain-Based Academic Record V erification) system, a comprehensive, privacy-preserving,\nand interoperable framework for managing academic credentials. ZKBAR-V is designed to\nenhance trust, security, and efficiency in academic verification processes by leveraging the\nfollowing innovations:\n• Zero-Knowledge Proofs (ZKPs)—Enables credential verification without revealing\nunderlying student data [9,10], improving privacy while maintaining trust.\n• Decentralized Identifiers (DIDs)—Establishes standardized, self-sovereign digital\nidentities for students, facilitating global academic m\nSensors 2025 ,25, 3450 3 of 24\nZKBAR-V is built upon the Blockchain Academic Credential Interoperability Protocol\n(BACIP), which establishes ethical, legal, and technical standards for academic credential\nmanagement [ 13]. The open-source nature of the system enables scalability, affordability,\nand global adoption, ensuring a low-cost, high-performance distributed architecture\nfor secure, privacy-enhanced, and universally verifiable academic credentialing. Our\narticle proposes the ZKBAR-V framework, which leverages zkEVM smart contracts,\ndual-blockchain architecture (public and private), decentralized identity (DID), and IPFS\nstorage to securely manage and verify academic credentials. Unlike traditional centralized\nverification methods, ZKBAR-V enhances privacy and security using Zero-Knowledge\nProofs (ZKPs), allowing credential verification without exposing sensitive data. Our main\ncontributions are as follows:\n• Privacy-Preserving Verification via ZKPs: We incorporate Zero-Knowledge Proofs to\nallow institutions and employers to verify the authenticity of academic credentials\nwithout revealing sensitive student data, offering stronger privacy than any\nexisting system.\n• Support for Self-Sovereign Identity with DIDs: ZKBAR-V leverages Decentralized\nIdentifiers (DIDs) to provide globally interoperable, self-sovereign identities that\neliminate the dependency on centralized databases for student identity verification.\n• Dual-Blockchain Architecture: We design a hybrid architecture that separates public\nand private data across two blockchains, balancing transparency (public chain) with\nprivacy and performance (private chain).\n• IPFS Integration for Secure Document Storage: Academic records are stored off-chain\nusing IPFS, ensuring decentralized, tamper-proof, and cost-effective data management.\n• zk-SNARK-Enabled Smart Contracts on zkEVM: By deploying smart contracts on a\nzkEVM-compatible environment, ZKBAR-V allows for on-chain credential validation\nwhile maintaining full privacy and compliance with regulations such as GDPR.\n• A Unified Framework for Global Interoperability: Unlike fragmented existing systems,\nZKBAR-V is designed as a comprehensive and extensible platform that facilitates\ninternational recognition and seamless verification of credentials.\nThe remainder of this paper is organized as follows: Section 2 discusses related work.\nSection 3 describes the proposed framework, including its architecture. Section 4 presents\nthe experimental setup and results, followed by a detailed performance evaluation. Finally,\nSection 6 concludes the paper and outlines future research directions.\n2. Literature Review\nIn this section, we present several related works in this domain to illustrate the current\nstate-of-the-art blockchain-based academic record management systems. Following this,\nwe provide the background research that is relevant to our study.\nSimilar to our ZKBAR-V approach, some complex frameworks have been developed;\nhowever, many are still \nSensors 2025 ,25, 3450 4 of 24\nhand, some systems have already been successfully implemented, allowing current use.\nFor example, Nadeem et al. [ 17] developed a system called the Hybrid Blockchain-based\nAcademic Credential Verification System (B-ACVS), which complies with GDPR regulations\nusing a public blockchain based on Ethereum. In addition to the development, they\nimplemented a functional system that was tested and validated.\nMIT’s Blockcerts system [ 5,18] remains one of the most influential blockchain-based\ncredentialing platforms, offering an open-source implementation that allows institutions\nto issue verifiable digital certificates on the Ethereum blockchain. However, it has\nlimitations that constrain its applicability in privacy-sensitive or regulatory contexts.\nNotably, Blockcerts lacks native support for Zero-Knowledge Proofs, which may potentially\ncause verification processes to expose sensitive metadata. Furthermore, its initial design\ndid not include Decentralized Identifiers (DIDs), thereby limiting self-sovereign identity\ncapabilities. Its reliance on a single-layer public blockchain also makes it less adaptable\nto institutions that need to separate public attestations from confidential academic data.\nIn contrast, ZKBAR-V enhances these foundational features by incorporating ZKPs, DIDs,\nand a dual-chain model, enabling scalable, privacy-preserving, and regulation-compliant\nacademic verification across institutional and national boundaries. On the other hand, Sony\nGlobal Education [ 19] created a framework for credential registration and accreditation,\nbut without using a public platform like Ethereum. Instead, it uses a private network\nsupported by Hyperledger Fabric deployed using IBM Cloud. This was because it did not\nneed to be a decentralized system, but rather, this is a system designed to manage foreign\nstudents arriving in Japan, with a variety of languages and learning paths. In this way,\nthey can have an unforgeable academic verification system. Even though this system\nis fully developed and functionally active, its source codes are not openly available;\nin fact, it is a system that operates only privately in Japan. Learning Machine, who\ncollaborated with MIT Media Lab in the creation of Blockcerts, was acquired by Hyland\nCredentials, who then created a paid version of this system using Blockcerts as a base\nby changing some components and offering more support and infrastructure for the\nintegration of the system, allowing institutions to delegate responsibilities; but this system\nis not open source. This platform does not have IPFS integrated, as it was integrated\ninto Blockcerts after its collaboration with Learning Machine; however, Hyland did add\nDecentralized Identifiers [20].\nThere have been several other solutions developed to secure the verification and usage\nof certificates in universities and higher education institutions around the globe. Due to the\nease of obtaining fake credentials, institutions are increasi\nSensors 2025 ,25, 3450 5 of 24\nconnects students, universities, governments, and employers to securely manage academic\nrecords. Tested successfully in both countries, the platform enhances education accessibility\nand aligns with the Sustainable Development Goal 4, promoting lifelong learning and\ninternational mobility. To improve certificate revocation and maintain trust in issued\ncredentials, Baldi et al. [ 23] developed a blockchain-based revocation mechanism using\npublic ledgers. While it mitigated single points of failure, users were required to manually\nquery Certificate Authorities to check revocation lists, which proved inefficient.\nWhile prior blockchain-based credential systems, such as that proposed by\nBaldi et al. [ 23], recognize the potential benefits of decentralization, they also face\nvulnerabilities to blockchain-specific threats—such as 51% attacks, Sybil nodes, or Denial of\nService vectors—particularly when relying on open, public networks. In our ZKBAR-V , we\naddress these concerns by adopting a dual-chain strategy that separates public verification\nfrom private academic operations. The private blockchain component operates in a\npermissioned environment, reducing susceptibility to external tampering. In addition,\nidentity verification and credential issuance are controlled via DIDs and regulated through\nsecure smart contracts. Our use of zk-SNARK-based verification ensures minimal on-chain\ndata exposure and resistance to manipulation, thus enhancing the overall trust model\nof our system. Lei et al. [ 24] attempted to address these inefficiencies by integrating\nrevocation within security and privacy protocols. However, their framework faced\nscalability challenges and was vulnerable to blockchain-based attacks. Building on the need\nfor efficient infrastructure, Haveri et al. [ 25] developed an Ethereum-based multi-node\nprivate blockchain system with off-chain document storage via IPFS. Despite enhanced data\ndecentralization, the use of Proof-of-Work resulted in high resource consumption. In [ 24],\nthe reliance on a PoW-based blockchain introduces high energy consumption and longer\ntransaction finality times, which can be barriers to real-time academic verification at scale.\nWhile this could be mitigated by adopting a different consensus algorithm, such a change\nwould require a redesign of the system’s trust model and infrastructure. Pawar et al.,\nusing the same system, noted high CPU usage and low system performance due to similar\narchitectural demands. While [ 25] demonstrates a practical blockchain implementation\nusing Ethereum and IPFS, it reports high CPU usage, which we believe may be a result\nof non-optimized smart contract logic and on-chain computation overhead. Rather than\ncritiquing the resource usage in isolation, we highlight this to contrast with ZKBAR-V’s\noff-chain zk-proof computation and dual-chain design, which separates sensitive processing\nfrom public verification, improving both efficiency and privacy. In trad"
  },
  {
    "file": "zero knowledge proof teqniques for enhanced privacy and scalability in blockchain system.pdf",
    "title": "Zero-Knowledge Proof Techniques for Enhanced Privacy and Scalability in Blockchain Systems",
    "text": "Zero-Knowledge Proof Techniques for Enhanced\nPrivacy and Scalability in Blockchain Systems\nJon Watkins\nDepartment of Computer Science\nAbstract. Blockchain technology has revolutionized distributed trust\nsystems, yet faces significant challenges regarding privacy preservation\nand scalability. This paper explores the integration of zero-knowledge\nproof (ZKP) techniques within blockchain architectures to address these\nlimitations. We present a comprehensive analysis of current ZKP imple-\nmentations in blockchain systems, including zk-SNARKs, zk-STARKs,\nand Bulletproofs, evaluating their theoretical foundations, practical ap-\nplications, and performance metrics. Our research demonstrates that\nwhile ZKP integration significantly enhances privacy guarantees and can\nimprove throughput via rollup technologies, implementation complexi-\nties and computational overhead remain barriers to widespread adop-\ntion. We propose an optimized framework for ZKP integration that bal-\nances privacy, scalability, and usability, potentially advancing the state\nof blockchain technology toward more effective real-world applications.\nKeywords: Blockchain ·Zero-Knowledge Proofs ·Privacy ·Scalability ·Cryp-\ntography ·zk-SNARKs ·zk-STARKs ·Bulletproofs\n1 Introduction\nBlockchain technology has emerged as a transformative approach to creating\ndistributed, transparent, and immutable ledger systems. Since the introduc-\ntion of Bitcoin by Satoshi Nakamoto [15], blockchain applications have ex-\npanded beyond cryptocurrencies to domains including supply chain manage-\nment, healthcare, digital identity, and governance systems [20]. Despite these\nadvances, blockchain technologies face persistent challenges in two critical areas:\nprivacy and scalability.\nPrivacy concerns arise from the inherently transparent nature of public blockchains,\nwhere transaction details are visible to all network participants. This trans-\nparency, while facilitating trust, compromises confidentiality requirements es-\nsential for many applications [14]. Concurrently, scalability limitations constrain\ntransaction throughput and increase costs, hindering mainstream adoption [7].\nZero-knowledge proofs (ZKPs) offer a promising cryptographic approach to\naddress both challenges simultaneously. ZKPs enable one party (the prover) to\nconvince another party (the verifier) that a statement is true without revealing\nany information beyond the validity of the statement itself [11]. In blockchain\n2 Jon Watkins\ncontexts, this property allows for the verification of transactions or smart con-\ntract executions without exposing sensitive data, simultaneously reducing the\non-chain computational and storage requirements.\nThis paper examines the intersection of ZKP techniques and blockchain tech-\nnology, with emphasis on:\n1. A systematic review of ZKP variants employed in blockchain systems\n2. Analysis of privacy and scalability enhancements achieved through ZKP in-\ntegration\n3. Evaluation of implementation challenges and performance considerations\n4. A proposed framework for optimized ZKP integration in blockchain archi-\ntectures\n2 Theoretical Background\n2.1 Fundamentals of Zero-Knowledge Proofs\nZero-knowledge proofs, first introduced by Goldwasser, Micali, and Rackoff in\n1985 [10], are cryptographic protocols satisfying three fundamental properties:\n1.Completeness : If the statement is true, an honest verifier will be convinced\nby an honest prover.\n2.Soundness : If the statement is false, no dishonest prover can convince the\nverifier that it is true, except with negligible probability.\n3.Zero-knowledge : If the statement is true, the verifier learns nothing other\nthan the fact that the statement is true.\nZKPs have evolved from interactive protocols requiring communication be-\ntween prover and verifier to non-interactive zero-knowledge proofs (NIZKs) where\na single message suffices for verification. This evolution has been particularly im-\nportant for blockchain applications, where interactive protocols are impractical\ndue to the asynchronous nature of distributed networks.\n2.2 Types of Zero-Knowledge Proof Systems\nSeveral ZKP systems have gained prominence in blockchain implementations:\nzk-SNARKs Zero-Knowledge Succinct Non-Interactive Arguments of Knowl-\nedge (zk-SNARKs) enable concise proofs that can be verified quickly. The con-\nstruction of zk-SNARKs typically involves:\n1. Expressing the computational statement as an arithmetic circuit\n2. Converting the circuit to a rank-1 constraint system (R1CS)\n3. Using a trusted setup procedure to generate proving and verification keys\n4. Creating and verifying proofs using these keys\nThe trusted setup requirement has been a point of concern, as it introduces\na potential security vulnerability if the setup parameters are compromised [2].\nTitle Suppressed Due to Excessive Length 3\nzk-STARKs Zero-Knowledge Scalable Transparent Arguments of Knowledge\n(zk-STARKs) address the trusted setup limitation of zk-SNARKs. Key features\ninclude:\n1. Transparency: No trusted setup required\n2. Post-quantum security: Resistant to attacks from quantum computers\n3. Scalability: Proving time scales quasi-linearly with computational complexity\nHowever, zk-STARKs typically generate larger proof sizes compared to zk-\nSNARKs, increasing on-chain storage requirements [1].\nBulletproofs Bulletproofs provide an efficient non-interactive zero-knowledge\nproof system without a trusted setup, particularly optimized for proving that\ncommitted values lie in a specific range. Advantages include:\n1. No trusted setup requirement\n2. Logarithmic proof size in the number of commitments\n3. Efficient batch verification\nBulletproofs are especially suited for confidential transactions in blockchain\nsystems, though verification time scales linearly with the size of the statement\nbeing proven [3].\n3 Integration of ZKPs in Blockchain Architectures\n3.1 Privacy-Focused Implementations\nZcash and zk-SNARKs Zcash pioneered the integration of zk-SNARKs in\nblockchain systems to enable private transactions. The protocol implements:\n1. Shielded transactions using the Sapling protocol\n2. Selective disclosure capabilities for regulatory compliance\n3. Efficient verification of transaction validity without revealing transaction\ndetails\nZcash’s implementation demonstrates the practical viability of ZKPs for pri-\nvacy enhancement, though the trusted setup requirement has been a subject of\nongoing research and improvement [13].\nMonero and Ring Signatures While not a pure ZKP implementation, Mon-\nero’s approach combines ring signatures, stealth addresses, and Ring Confiden-\ntial Transactions (RingCT) to achieve privacy. Recent research has explored\nintegrating Bulletproofs into Monero to enhance efficiency [16].\n4 Jon Watkins\nPrivacy-Preserving Smart Contracts ZKPs enable privacy-preserving com-\nputation in smart contract platforms like:\n1.Aztec Protocol : A privacy layer for Ethereum using zk-SNARKs\n2.Nightfall : An EY-developed solution for private ERC-20/ERC-721 token\ntransfers\n3.Secret Network : A blockchain with privacy-preserving smart contracts\nThese implementations enable confidential token transfers and private smart\ncontract execution while maintaining the verifiability of blockchain systems [18].\n3.2 Scalability-Focused Implementations\nZK-Rollups ZK-Rollups address scalability by moving computation and state\nstorage off-chain while maintaining security through ZKPs:\n1. Transaction batching with succinct validity proofs\n2. Significant throughput improvements (100-2000x depending on implementa-\ntion)\n3. Immediate finality upon proof verification\nNotable implementations include zkSync, StarkNet, and Loopring, each em-\nploying different ZKP systems and optimization strategies [4].\nValidium and Volition Systems These hybrid approaches use ZKPs for va-\nlidity but differ in data availability solutions:\n1.Validium : Stores data off-chain, maximizing throughput but requiring data\navailability committees\n2.Volition : Allows users to choose between on-chain and off-chain data storage\nfor each transaction\nThese systems highlight the flexibility of ZKP integration in addressing spe-\ncific blockchain requirements [17].\n3.3 Hybrid Approaches\nRecent developments focus on solutions that simultaneously address privacy and\nscalability:\n1.Mina Protocol : Uses a succinct blockchain with a fixed size of 22KB\nthrough recursive zk-SNARKs\n2.Aztec Connect : Combines private transactions with gas efficiency through\nbatched proofs\n3.Aleo : Provides private application development with integrated ZKP capa-\nbilities\nThese approaches demonstrate the evolving sophistication of ZKP applica-\ntions in blockchain systems [6].\nTitle Suppressed Due to Excessive Length 5\n4 Performance Analysis and Implementation Challenges\n4.1 Computational Efficiency\nZKP systems vary significantly in their computational requirements:\nZKP System Proof Generation Verification Time Proof Size Setup Requirement\nzk-SNARKs Moderate-High Very Low (constant) Small ( 200 bytes) Trusted setup\nzk-STARKs High Low (logarithmic) Large ( 10-100 KB) No trusted setup\nBulletproofs Moderate Moderate-High Medium ( 1-2 KB) No trusted setup\nTable 1. Comparison of ZKP systems performance characteristics\nOur benchmarks on representative blockchain implementations reveal sig-\nnificant variations in performance across different hardware configurations and\noptimization levels. Particularly, proof generation remains computationally in-\ntensive, requiring specialized hardware for efficient operation in high-throughput\nenvironments [19].\n4.2 Security Considerations\nSecurity analysis of ZKP implementations in blockchain contexts reveals several\nconsiderations:\n1.Trusted Setup Vulnerabilities : Systems requiring trusted setup face po-\ntential compromise if setup parameters are not securely generated and de-\nstroyed.\n2.Cryptographic Assumptions : Different ZKP systems rely on varying\ncryptographic assumptions, affecting their long-term security guarantees.\n3.Implementation Correctness : The complexity of ZKP systems increases\nthe risk of implementation errors.\n4.Quantum Resistance : Only certain ZKP systems (notably zk-STARKs)\noffer post-quantum security guarantees.\nOur analysis of existing implementations indicates that these security consid-\nerations are often addressed through multi-party computation for trusted setups,\nformal verification of implementations, and ongoing cryptographic research [9].\n4.3 Developer Experience and Tooling\nThe complexity of ZKP implementation presents significant barriers to adoption:\n1.Circuit Design : Expressing computational logic as constraints suitable for\nZKP generation requires specialized knowledge."
  }
]
